GopalSaraf/Practicals/PSDL/include/proc/pic16lf1779.inc
// Register: COG1PHR
#define COG1PHR COG1PHR
COG1PHR                                  equ 068Dh
// bitfield definitions
COG1PHR_PHR_POSN                         equ 0000h
COG1PHR_PHR_POSITION                     equ 0000h
COG1PHR_PHR_SIZE                         equ 0006h
COG1PHR_PHR_LENGTH                       equ 0006h
COG1PHR_PHR_MASK                         equ 003Fh
COG1PHR_PHR0_POSN                        equ 0000h
COG1PHR_PHR0_POSITION                    equ 0000h
COG1PHR_PHR0_SIZE                        equ 0001h
COG1PHR_PHR0_LENGTH                      equ 0001h
COG1PHR_PHR0_MASK                        equ 0001h
COG1PHR_PHR1_POSN                        equ 0001h
COG1PHR_PHR1_POSITION                    equ 0001h
COG1PHR_PHR1_SIZE                        equ 0001h
COG1PHR_PHR1_LENGTH                      equ 0001h
COG1PHR_PHR1_MASK                        equ 0002h
COG1PHR_PHR2_POSN                        equ 0002h
COG1PHR_PHR2_POSITION                    equ 0002h
COG1PHR_PHR2_SIZE                        equ 0001h
COG1PHR_PHR2_LENGTH                      equ 0001h
COG1PHR_PHR2_MASK                        equ 0004h
COG1PHR_PHR3_POSN                        equ 0003h
COG1PHR_PHR3_POSITION                    equ 0003h
COG1PHR_PHR3_SIZE                        equ 0001h
COG1PHR_PHR3_LENGTH                      equ 0001h
COG1PHR_PHR3_MASK                        equ 0008h
COG1PHR_PHR4_POSN                        equ 0004h
COG1PHR_PHR4_POSITION                    equ 0004h
COG1PHR_PHR4_SIZE                        equ 0001h
COG1PHR_PHR4_LENGTH                      equ 0001h
COG1PHR_PHR4_MASK                        equ 0010h
COG1PHR_PHR5_POSN                        equ 0005h
COG1PHR_PHR5_POSITION                    equ 0005h
COG1PHR_PHR5_SIZE                        equ 0001h
COG1PHR_PHR5_LENGTH                      equ 0001h
COG1PHR_PHR5_MASK                        equ 0020h
COG1PHR_G1PHR0_POSN                      equ 0000h
COG1PHR_G1PHR0_POSITION                  equ 0000h
COG1PHR_G1PHR0_SIZE                      equ 0001h
COG1PHR_G1PHR0_LENGTH                    equ 0001h
COG1PHR_G1PHR0_MASK                      equ 0001h
COG1PHR_G1PHR1_POSN                      equ 0001h
COG1PHR_G1PHR1_POSITION                  equ 0001h
COG1PHR_G1PHR1_SIZE                      equ 0001h
COG1PHR_G1PHR1_LENGTH                    equ 0001h
COG1PHR_G1PHR1_MASK                      equ 0002h
COG1PHR_G1PHR2_POSN                      equ 0002h
COG1PHR_G1PHR2_POSITION                  equ 0002h
COG1PHR_G1PHR2_SIZE                      equ 0001h
COG1PHR_G1PHR2_LENGTH                    equ 0001h
COG1PHR_G1PHR2_MASK                      equ 0004h
COG1PHR_G1PHR3_POSN                      equ 0003h
COG1PHR_G1PHR3_POSITION                  equ 0003h
COG1PHR_G1PHR3_SIZE                      equ 0001h
COG1PHR_G1PHR3_LENGTH                    equ 0001h
COG1PHR_G1PHR3_MASK                      equ 0008h
COG1PHR_G1PHR4_POSN                      equ 0004h
COG1PHR_G1PHR4_POSITION                  equ 0004h
COG1PHR_G1PHR4_SIZE                      equ 0001h
COG1PHR_G1PHR4_LENGTH                    equ 0001h
COG1PHR_G1PHR4_MASK                      equ 0010h
COG1PHR_G1PHR5_POSN                      equ 0005h
COG1PHR_G1PHR5_POSITION                  equ 0005h
COG1PHR_G1PHR5_SIZE                      equ 0001h
COG1PHR_G1PHR5_LENGTH                    equ 0001h
COG1PHR_G1PHR5_MASK                      equ 0020h

// Register: COG1PHF
#define COG1PHF COG1PHF
COG1PHF                                  equ 068Eh
// bitfield definitions
COG1PHF_PHF_POSN                         equ 0000h
COG1PHF_PHF_POSITION                     equ 0000h
COG1PHF_PHF_SIZE                         equ 0006h
COG1PHF_PHF_LENGTH                       equ 0006h
COG1PHF_PHF_MASK                         equ 003Fh
COG1PHF_PHF0_POSN                        equ 0000h
COG1PHF_PHF0_POSITION                    equ 0000h
COG1PHF_PHF0_SIZE                        equ 0001h
COG1PHF_PHF0_LENGTH                      equ 0001h
COG1PHF_PHF0_MASK                        equ 0001h
COG1PHF_PHF1_POSN                        equ 0001h
COG1PHF_PHF1_POSITION                    equ 0001h
COG1PHF_PHF1_SIZE                        equ 0001h
COG1PHF_PHF1_LENGTH                      equ 0001h
COG1PHF_PHF1_MASK                        equ 0002h
COG1PHF_PHF2_POSN                        equ 0002h
COG1PHF_PHF2_POSITION                    equ 0002h
COG1PHF_PHF2_SIZE                        equ 0001h
COG1PHF_PHF2_LENGTH                      equ 0001h
COG1PHF_PHF2_MASK                        equ 0004h
COG1PHF_PHF3_POSN                        equ 0003h
COG1PHF_PHF3_POSITION                    equ 0003h
COG1PHF_PHF3_SIZE                        equ 0001h
COG1PHF_PHF3_LENGTH                      equ 0001h
COG1PHF_PHF3_MASK                        equ 0008h
COG1PHF_PHF4_POSN                        equ 0004h
COG1PHF_PHF4_POSITION                    equ 0004h
COG1PHF_PHF4_SIZE                        equ 0001h
COG1PHF_PHF4_LENGTH                      equ 0001h
COG1PHF_PHF4_MASK                        equ 0010h
COG1PHF_PHF5_POSN                        equ 0005h
COG1PHF_PHF5_POSITION                    equ 0005h
COG1PHF_PHF5_SIZE                        equ 0001h
COG1PHF_PHF5_LENGTH                      equ 0001h
COG1PHF_PHF5_MASK                        equ 0020h
COG1PHF_G1PHF0_POSN                      equ 0000h
COG1PHF_G1PHF0_POSITION                  equ 0000h
COG1PHF_G1PHF0_SIZE                      equ 0001h
COG1PHF_G1PHF0_LENGTH                    equ 0001h
COG1PHF_G1PHF0_MASK                      equ 0001h
COG1PHF_G1PHF1_POSN                      equ 0001h
COG1PHF_G1PHF1_POSITION                  equ 0001h
COG1PHF_G1PHF1_SIZE                      equ 0001h
COG1PHF_G1PHF1_LENGTH                    equ 0001h
COG1PHF_G1PHF1_MASK                      equ 0002h
COG1PHF_G1PHF2_POSN                      equ 0002h
COG1PHF_G1PHF2_POSITION                  equ 0002h
COG1PHF_G1PHF2_SIZE                      equ 0001h
COG1PHF_G1PHF2_LENGTH                    equ 0001h
COG1PHF_G1PHF2_MASK                      equ 0004h
COG1PHF_G1PHF3_POSN                      equ 0003h
COG1PHF_G1PHF3_POSITION                  equ 0003h
COG1PHF_G1PHF3_SIZE                      equ 0001h
COG1PHF_G1PHF3_LENGTH                    equ 0001h
COG1PHF_G1PHF3_MASK                      equ 0008h
COG1PHF_G1PHF4_POSN                      equ 0004h
COG1PHF_G1PHF4_POSITION                  equ 0004h
COG1PHF_G1PHF4_SIZE                      equ 0001h
COG1PHF_G1PHF4_LENGTH                    equ 0001h
COG1PHF_G1PHF4_MASK                      equ 0010h
COG1PHF_G1PHF5_POSN                      equ 0005h
COG1PHF_G1PHF5_POSITION                  equ 0005h
COG1PHF_G1PHF5_SIZE                      equ 0001h
COG1PHF_G1PHF5_LENGTH                    equ 0001h
COG1PHF_G1PHF5_MASK                      equ 0020h

