GopalSaraf/Practicals/PSDL/include/proc/pic16lf1779.inc
// Register: COG3BLKR
#define COG3BLKR COG3BLKR
COG3BLKR                                 equ 080Fh
// bitfield definitions
COG3BLKR_BLKR_POSN                       equ 0000h
COG3BLKR_BLKR_POSITION                   equ 0000h
COG3BLKR_BLKR_SIZE                       equ 0006h
COG3BLKR_BLKR_LENGTH                     equ 0006h
COG3BLKR_BLKR_MASK                       equ 003Fh
COG3BLKR_BLKR0_POSN                      equ 0000h
COG3BLKR_BLKR0_POSITION                  equ 0000h
COG3BLKR_BLKR0_SIZE                      equ 0001h
COG3BLKR_BLKR0_LENGTH                    equ 0001h
COG3BLKR_BLKR0_MASK                      equ 0001h
COG3BLKR_BLKR1_POSN                      equ 0001h
COG3BLKR_BLKR1_POSITION                  equ 0001h
COG3BLKR_BLKR1_SIZE                      equ 0001h
COG3BLKR_BLKR1_LENGTH                    equ 0001h
COG3BLKR_BLKR1_MASK                      equ 0002h
COG3BLKR_BLKR2_POSN                      equ 0002h
COG3BLKR_BLKR2_POSITION                  equ 0002h
COG3BLKR_BLKR2_SIZE                      equ 0001h
COG3BLKR_BLKR2_LENGTH                    equ 0001h
COG3BLKR_BLKR2_MASK                      equ 0004h
COG3BLKR_BLKR3_POSN                      equ 0003h
COG3BLKR_BLKR3_POSITION                  equ 0003h
COG3BLKR_BLKR3_SIZE                      equ 0001h
COG3BLKR_BLKR3_LENGTH                    equ 0001h
COG3BLKR_BLKR3_MASK                      equ 0008h
COG3BLKR_BLKR4_POSN                      equ 0004h
COG3BLKR_BLKR4_POSITION                  equ 0004h
COG3BLKR_BLKR4_SIZE                      equ 0001h
COG3BLKR_BLKR4_LENGTH                    equ 0001h
COG3BLKR_BLKR4_MASK                      equ 0010h
COG3BLKR_BLKR5_POSN                      equ 0005h
COG3BLKR_BLKR5_POSITION                  equ 0005h
COG3BLKR_BLKR5_SIZE                      equ 0001h
COG3BLKR_BLKR5_LENGTH                    equ 0001h
COG3BLKR_BLKR5_MASK                      equ 0020h
COG3BLKR_G3BLKR0_POSN                    equ 0000h
COG3BLKR_G3BLKR0_POSITION                equ 0000h
COG3BLKR_G3BLKR0_SIZE                    equ 0001h
COG3BLKR_G3BLKR0_LENGTH                  equ 0001h
COG3BLKR_G3BLKR0_MASK                    equ 0001h
COG3BLKR_G3BLKR1_POSN                    equ 0001h
COG3BLKR_G3BLKR1_POSITION                equ 0001h
COG3BLKR_G3BLKR1_SIZE                    equ 0001h
COG3BLKR_G3BLKR1_LENGTH                  equ 0001h
COG3BLKR_G3BLKR1_MASK                    equ 0002h
COG3BLKR_G3BLKR2_POSN                    equ 0002h
COG3BLKR_G3BLKR2_POSITION                equ 0002h
COG3BLKR_G3BLKR2_SIZE                    equ 0001h
COG3BLKR_G3BLKR2_LENGTH                  equ 0001h
COG3BLKR_G3BLKR2_MASK                    equ 0004h
COG3BLKR_G3BLKR3_POSN                    equ 0003h
COG3BLKR_G3BLKR3_POSITION                equ 0003h
COG3BLKR_G3BLKR3_SIZE                    equ 0001h
COG3BLKR_G3BLKR3_LENGTH                  equ 0001h
COG3BLKR_G3BLKR3_MASK                    equ 0008h
COG3BLKR_G3BLKR4_POSN                    equ 0004h
COG3BLKR_G3BLKR4_POSITION                equ 0004h
COG3BLKR_G3BLKR4_SIZE                    equ 0001h
COG3BLKR_G3BLKR4_LENGTH                  equ 0001h
COG3BLKR_G3BLKR4_MASK                    equ 0010h
COG3BLKR_G3BLKR5_POSN                    equ 0005h
COG3BLKR_G3BLKR5_POSITION                equ 0005h
COG3BLKR_G3BLKR5_SIZE                    equ 0001h
COG3BLKR_G3BLKR5_LENGTH                  equ 0001h
COG3BLKR_G3BLKR5_MASK                    equ 0020h

// Register: COG3BLKF
#define COG3BLKF COG3BLKF
COG3BLKF                                 equ 0810h
// bitfield definitions
COG3BLKF_BLKF_POSN                       equ 0000h
COG3BLKF_BLKF_POSITION                   equ 0000h
COG3BLKF_BLKF_SIZE                       equ 0006h
COG3BLKF_BLKF_LENGTH                     equ 0006h
COG3BLKF_BLKF_MASK                       equ 003Fh
COG3BLKF_BLKF0_POSN                      equ 0000h
COG3BLKF_BLKF0_POSITION                  equ 0000h
COG3BLKF_BLKF0_SIZE                      equ 0001h
COG3BLKF_BLKF0_LENGTH                    equ 0001h
COG3BLKF_BLKF0_MASK                      equ 0001h
COG3BLKF_BLKF1_POSN                      equ 0001h
COG3BLKF_BLKF1_POSITION                  equ 0001h
COG3BLKF_BLKF1_SIZE                      equ 0001h
COG3BLKF_BLKF1_LENGTH                    equ 0001h
COG3BLKF_BLKF1_MASK                      equ 0002h
COG3BLKF_BLKF2_POSN                      equ 0002h
COG3BLKF_BLKF2_POSITION                  equ 0002h
COG3BLKF_BLKF2_SIZE                      equ 0001h
COG3BLKF_BLKF2_LENGTH                    equ 0001h
COG3BLKF_BLKF2_MASK                      equ 0004h
COG3BLKF_BLKF3_POSN                      equ 0003h
COG3BLKF_BLKF3_POSITION                  equ 0003h
COG3BLKF_BLKF3_SIZE                      equ 0001h
COG3BLKF_BLKF3_LENGTH                    equ 0001h
COG3BLKF_BLKF3_MASK                      equ 0008h
COG3BLKF_BLKF4_POSN                      equ 0004h
COG3BLKF_BLKF4_POSITION                  equ 0004h
COG3BLKF_BLKF4_SIZE                      equ 0001h
COG3BLKF_BLKF4_LENGTH                    equ 0001h
COG3BLKF_BLKF4_MASK                      equ 0010h
COG3BLKF_BLKF5_POSN                      equ 0005h
COG3BLKF_BLKF5_POSITION                  equ 0005h
COG3BLKF_BLKF5_SIZE                      equ 0001h
COG3BLKF_BLKF5_LENGTH                    equ 0001h
COG3BLKF_BLKF5_MASK                      equ 0020h
COG3BLKF_G3BLKF0_POSN                    equ 0000h
COG3BLKF_G3BLKF0_POSITION                equ 0000h
COG3BLKF_G3BLKF0_SIZE                    equ 0001h
COG3BLKF_G3BLKF0_LENGTH                  equ 0001h
COG3BLKF_G3BLKF0_MASK                    equ 0001h
COG3BLKF_G3BLKF1_POSN                    equ 0001h
COG3BLKF_G3BLKF1_POSITION                equ 0001h
COG3BLKF_G3BLKF1_SIZE                    equ 0001h
COG3BLKF_G3BLKF1_LENGTH                  equ 0001h
COG3BLKF_G3BLKF1_MASK                    equ 0002h
COG3BLKF_G3BLKF2_POSN                    equ 0002h
COG3BLKF_G3BLKF2_POSITION                equ 0002h
COG3BLKF_G3BLKF2_SIZE                    equ 0001h
COG3BLKF_G3BLKF2_LENGTH                  equ 0001h
COG3BLKF_G3BLKF2_MASK                    equ 0004h
COG3BLKF_G3BLKF3_POSN                    equ 0003h
COG3BLKF_G3BLKF3_POSITION                equ 0003h
COG3BLKF_G3BLKF3_SIZE                    equ 0001h
COG3BLKF_G3BLKF3_LENGTH                  equ 0001h
COG3BLKF_G3BLKF3_MASK                    equ 0008h
COG3BLKF_G3BLKF4_POSN                    equ 0004h
COG3BLKF_G3BLKF4_POSITION                equ 0004h
COG3BLKF_G3BLKF4_SIZE                    equ 0001h
COG3BLKF_G3BLKF4_LENGTH                  equ 0001h
COG3BLKF_G3BLKF4_MASK                    equ 0010h
COG3BLKF_G3BLKF5_POSN                    equ 0005h
COG3BLKF_G3BLKF5_POSITION                equ 0005h
COG3BLKF_G3BLKF5_SIZE                    equ 0001h
COG3BLKF_G3BLKF5_LENGTH                  equ 0001h
COG3BLKF_G3BLKF5_MASK                    equ 0020h

// Register: COG3DBR
#define COG3DBR COG3DBR
COG3DBR                                  equ 0811h
// bitfield definitions
COG3DBR_DBR_POSN                         equ 0000h
COG3DBR_DBR_POSITION                     equ 0000h
COG3DBR_DBR_SIZE                         equ 0006h
COG3DBR_DBR_LENGTH                       equ 0006h
COG3DBR_DBR_MASK                         equ 003Fh
COG3DBR_DBR0_POSN                        equ 0000h
COG3DBR_DBR0_POSITION                    equ 0000h
COG3DBR_DBR0_SIZE                        equ 0001h
COG3DBR_DBR0_LENGTH                      equ 0001h
COG3DBR_DBR0_MASK                        equ 0001h
COG3DBR_DBR1_POSN                        equ 0001h
COG3DBR_DBR1_POSITION                    equ 0001h
COG3DBR_DBR1_SIZE                        equ 0001h
COG3DBR_DBR1_LENGTH                      equ 0001h
COG3DBR_DBR1_MASK                        equ 0002h
COG3DBR_DBR2_POSN                        equ 0002h
COG3DBR_DBR2_POSITION                    equ 0002h
COG3DBR_DBR2_SIZE                        equ 0001h
COG3DBR_DBR2_LENGTH                      equ 0001h
COG3DBR_DBR2_MASK                        equ 0004h
COG3DBR_DBR3_POSN                        equ 0003h
COG3DBR_DBR3_POSITION                    equ 0003h
COG3DBR_DBR3_SIZE                        equ 0001h
COG3DBR_DBR3_LENGTH                      equ 0001h
COG3DBR_DBR3_MASK                        equ 0008h
COG3DBR_DBR4_POSN                        equ 0004h
COG3DBR_DBR4_POSITION                    equ 0004h
COG3DBR_DBR4_SIZE                        equ 0001h
COG3DBR_DBR4_LENGTH                      equ 0001h
COG3DBR_DBR4_MASK                        equ 0010h
COG3DBR_DBR5_POSN                        equ 0005h
COG3DBR_DBR5_POSITION                    equ 0005h
COG3DBR_DBR5_SIZE                        equ 0001h
COG3DBR_DBR5_LENGTH                      equ 0001h
COG3DBR_DBR5_MASK                        equ 0020h
COG3DBR_G3DBR0_POSN                      equ 0000h
COG3DBR_G3DBR0_POSITION                  equ 0000h
COG3DBR_G3DBR0_SIZE                      equ 0001h
COG3DBR_G3DBR0_LENGTH                    equ 0001h
COG3DBR_G3DBR0_MASK                      equ 0001h
COG3DBR_G3DBR1_POSN                      equ 0001h
COG3DBR_G3DBR1_POSITION                  equ 0001h
COG3DBR_G3DBR1_SIZE                      equ 0001h
COG3DBR_G3DBR1_LENGTH                    equ 0001h
COG3DBR_G3DBR1_MASK                      equ 0002h
COG3DBR_G3DBR2_POSN                      equ 0002h
COG3DBR_G3DBR2_POSITION                  equ 0002h
COG3DBR_G3DBR2_SIZE                      equ 0001h
COG3DBR_G3DBR2_LENGTH                    equ 0001h
COG3DBR_G3DBR2_MASK                      equ 0004h
COG3DBR_G3DBR3_POSN                      equ 0003h
COG3DBR_G3DBR3_POSITION                  equ 0003h
COG3DBR_G3DBR3_SIZE                      equ 0001h
COG3DBR_G3DBR3_LENGTH                    equ 0001h
COG3DBR_G3DBR3_MASK                      equ 0008h
COG3DBR_G3DBR4_POSN                      equ 0004h
COG3DBR_G3DBR4_POSITION                  equ 0004h
COG3DBR_G3DBR4_SIZE                      equ 0001h
COG3DBR_G3DBR4_LENGTH                    equ 0001h
COG3DBR_G3DBR4_MASK                      equ 0010h
COG3DBR_G3DBR5_POSN                      equ 0005h
COG3DBR_G3DBR5_POSITION                  equ 0005h
COG3DBR_G3DBR5_SIZE                      equ 0001h
COG3DBR_G3DBR5_LENGTH                    equ 0001h
COG3DBR_G3DBR5_MASK                      equ 0020h

// Register: COG3DBF
#define COG3DBF COG3DBF
COG3DBF                                  equ 0812h
// bitfield definitions
COG3DBF_DBF0_POSN                        equ 0000h
COG3DBF_DBF0_POSITION                    equ 0000h
COG3DBF_DBF0_SIZE                        equ 0001h
COG3DBF_DBF0_LENGTH                      equ 0001h
COG3DBF_DBF0_MASK                        equ 0001h
COG3DBF_DBF1_POSN                        equ 0001h
COG3DBF_DBF1_POSITION                    equ 0001h
COG3DBF_DBF1_SIZE                        equ 0001h
COG3DBF_DBF1_LENGTH                      equ 0001h
COG3DBF_DBF1_MASK                        equ 0002h
COG3DBF_DBF2_POSN                        equ 0002h
COG3DBF_DBF2_POSITION                    equ 0002h
COG3DBF_DBF2_SIZE                        equ 0001h
COG3DBF_DBF2_LENGTH                      equ 0001h
COG3DBF_DBF2_MASK                        equ 0004h
COG3DBF_DBF3_POSN                        equ 0003h
COG3DBF_DBF3_POSITION                    equ 0003h
COG3DBF_DBF3_SIZE                        equ 0001h
COG3DBF_DBF3_LENGTH                      equ 0001h
COG3DBF_DBF3_MASK                        equ 0008h
COG3DBF_DBF4_POSN                        equ 0004h
COG3DBF_DBF4_POSITION                    equ 0004h
COG3DBF_DBF4_SIZE                        equ 0001h
COG3DBF_DBF4_LENGTH                      equ 0001h
COG3DBF_DBF4_MASK                        equ 0010h
COG3DBF_DBF5_POSN                        equ 0005h
COG3DBF_DBF5_POSITION                    equ 0005h
COG3DBF_DBF5_SIZE                        equ 0001h
COG3DBF_DBF5_LENGTH                      equ 0001h
COG3DBF_DBF5_MASK                        equ 0020h
COG3DBF_G3DBF0_POSN                      equ 0000h
COG3DBF_G3DBF0_POSITION                  equ 0000h
COG3DBF_G3DBF0_SIZE                      equ 0001h
COG3DBF_G3DBF0_LENGTH                    equ 0001h
COG3DBF_G3DBF0_MASK                      equ 0001h
COG3DBF_G3DBF1_POSN                      equ 0001h
COG3DBF_G3DBF1_POSITION                  equ 0001h
COG3DBF_G3DBF1_SIZE                      equ 0001h
COG3DBF_G3DBF1_LENGTH                    equ 0001h
COG3DBF_G3DBF1_MASK                      equ 0002h
COG3DBF_G3DBF2_POSN                      equ 0002h
COG3DBF_G3DBF2_POSITION                  equ 0002h
COG3DBF_G3DBF2_SIZE                      equ 0001h
COG3DBF_G3DBF2_LENGTH                    equ 0001h
COG3DBF_G3DBF2_MASK                      equ 0004h
COG3DBF_G3DBF3_POSN                      equ 0003h
COG3DBF_G3DBF3_POSITION                  equ 0003h
COG3DBF_G3DBF3_SIZE                      equ 0001h
COG3DBF_G3DBF3_LENGTH                    equ 0001h
COG3DBF_G3DBF3_MASK                      equ 0008h
COG3DBF_G3DBF4_POSN                      equ 0004h
COG3DBF_G3DBF4_POSITION                  equ 0004h
COG3DBF_G3DBF4_SIZE                      equ 0001h
COG3DBF_G3DBF4_LENGTH                    equ 0001h
COG3DBF_G3DBF4_MASK                      equ 0010h
COG3DBF_G3DBF5_POSN                      equ 0005h
COG3DBF_G3DBF5_POSITION                  equ 0005h
COG3DBF_G3DBF5_SIZE                      equ 0001h
COG3DBF_G3DBF5_LENGTH                    equ 0001h
COG3DBF_G3DBF5_MASK                      equ 0020h
COG3DBF_G3DBF_POSN                       equ 0000h
COG3DBF_G3DBF_POSITION                   equ 0000h
COG3DBF_G3DBF_SIZE                       equ 0006h
COG3DBF_G3DBF_LENGTH                     equ 0006h
COG3DBF_G3DBF_MASK                       equ 003Fh

// Register: COG3CON0
#define COG3CON0 COG3CON0
COG3CON0                                 equ 0813h
// bitfield definitions
COG3CON0_MD_POSN                         equ 0000h
COG3CON0_MD_POSITION                     equ 0000h
COG3CON0_MD_SIZE                         equ 0003h
COG3CON0_MD_LENGTH                       equ 0003h
COG3CON0_MD_MASK                         equ 0007h
COG3CON0_CS_POSN                         equ 0003h
COG3CON0_CS_POSITION                     equ 0003h
COG3CON0_CS_SIZE                         equ 0002h
COG3CON0_CS_LENGTH                       equ 0002h
COG3CON0_CS_MASK                         equ 0018h
COG3CON0_LD_POSN                         equ 0006h
COG3CON0_LD_POSITION                     equ 0006h
COG3CON0_LD_SIZE                         equ 0001h
COG3CON0_LD_LENGTH                       equ 0001h
COG3CON0_LD_MASK                         equ 0040h
COG3CON0_EN_POSN                         equ 0007h
COG3CON0_EN_POSITION                     equ 0007h
COG3CON0_EN_SIZE                         equ 0001h
COG3CON0_EN_LENGTH                       equ 0001h
COG3CON0_EN_MASK                         equ 0080h
COG3CON0_MD0_POSN                        equ 0000h
COG3CON0_MD0_POSITION                    equ 0000h
COG3CON0_MD0_SIZE                        equ 0001h
COG3CON0_MD0_LENGTH                      equ 0001h
COG3CON0_MD0_MASK                        equ 0001h
COG3CON0_MD1_POSN                        equ 0001h
COG3CON0_MD1_POSITION                    equ 0001h
COG3CON0_MD1_SIZE                        equ 0001h
COG3CON0_MD1_LENGTH                      equ 0001h
COG3CON0_MD1_MASK                        equ 0002h
COG3CON0_MD2_POSN                        equ 0002h
COG3CON0_MD2_POSITION                    equ 0002h
COG3CON0_MD2_SIZE                        equ 0001h
COG3CON0_MD2_LENGTH                      equ 0001h
COG3CON0_MD2_MASK                        equ 0004h
COG3CON0_CS0_POSN                        equ 0003h
COG3CON0_CS0_POSITION                    equ 0003h
COG3CON0_CS0_SIZE                        equ 0001h
COG3CON0_CS0_LENGTH                      equ 0001h
COG3CON0_CS0_MASK                        equ 0008h
COG3CON0_CS1_POSN                        equ 0004h
COG3CON0_CS1_POSITION                    equ 0004h
COG3CON0_CS1_SIZE                        equ 0001h
COG3CON0_CS1_LENGTH                      equ 0001h
COG3CON0_CS1_MASK                        equ 0010h
COG3CON0_G3MD_POSN                       equ 0000h
COG3CON0_G3MD_POSITION                   equ 0000h
COG3CON0_G3MD_SIZE                       equ 0003h
COG3CON0_G3MD_LENGTH                     equ 0003h
COG3CON0_G3MD_MASK                       equ 0007h
COG3CON0_G3CS_POSN                       equ 0003h
COG3CON0_G3CS_POSITION                   equ 0003h
COG3CON0_G3CS_SIZE                       equ 0002h
COG3CON0_G3CS_LENGTH                     equ 0002h
COG3CON0_G3CS_MASK                       equ 0018h
COG3CON0_G3LD_POSN                       equ 0006h
COG3CON0_G3LD_POSITION                   equ 0006h
COG3CON0_G3LD_SIZE                       equ 0001h
COG3CON0_G3LD_LENGTH                     equ 0001h
COG3CON0_G3LD_MASK                       equ 0040h
COG3CON0_G3EN_POSN                       equ 0007h
COG3CON0_G3EN_POSITION                   equ 0007h
COG3CON0_G3EN_SIZE                       equ 0001h
COG3CON0_G3EN_LENGTH                     equ 0001h
COG3CON0_G3EN_MASK                       equ 0080h
COG3CON0_G3MD0_POSN                      equ 0000h
COG3CON0_G3MD0_POSITION                  equ 0000h
COG3CON0_G3MD0_SIZE                      equ 0001h
COG3CON0_G3MD0_LENGTH                    equ 0001h
COG3CON0_G3MD0_MASK                      equ 0001h
COG3CON0_G3MD1_POSN                      equ 0001h
COG3CON0_G3MD1_POSITION                  equ 0001h
COG3CON0_G3MD1_SIZE                      equ 0001h
COG3CON0_G3MD1_LENGTH                    equ 0001h
COG3CON0_G3MD1_MASK                      equ 0002h
COG3CON0_G3MD2_POSN                      equ 0002h
COG3CON0_G3MD2_POSITION                  equ 0002h
COG3CON0_G3MD2_SIZE                      equ 0001h
COG3CON0_G3MD2_LENGTH                    equ 0001h
COG3CON0_G3MD2_MASK                      equ 0004h
COG3CON0_G3CS0_POSN                      equ 0003h
COG3CON0_G3CS0_POSITION                  equ 0003h
COG3CON0_G3CS0_SIZE                      equ 0001h
COG3CON0_G3CS0_LENGTH                    equ 0001h
COG3CON0_G3CS0_MASK                      equ 0008h
COG3CON0_G3CS1_POSN                      equ 0004h
COG3CON0_G3CS1_POSITION                  equ 0004h
COG3CON0_G3CS1_SIZE                      equ 0001h
COG3CON0_G3CS1_LENGTH                    equ 0001h
COG3CON0_G3CS1_MASK                      equ 0010h

// Register: COG3CON1
#define COG3CON1 COG3CON1
COG3CON1                                 equ 0814h
// bitfield definitions
COG3CON1_POLA_POSN                       equ 0000h
COG3CON1_POLA_POSITION                   equ 0000h
COG3CON1_POLA_SIZE                       equ 0001h
COG3CON1_POLA_LENGTH                     equ 0001h
COG3CON1_POLA_MASK                       equ 0001h
COG3CON1_POLB_POSN                       equ 0001h
COG3CON1_POLB_POSITION                   equ 0001h
COG3CON1_POLB_SIZE                       equ 0001h
COG3CON1_POLB_LENGTH                     equ 0001h
COG3CON1_POLB_MASK                       equ 0002h
COG3CON1_POLC_POSN                       equ 0002h
COG3CON1_POLC_POSITION                   equ 0002h
COG3CON1_POLC_SIZE                       equ 0001h
COG3CON1_POLC_LENGTH                     equ 0001h
COG3CON1_POLC_MASK                       equ 0004h
COG3CON1_POLD_POSN                       equ 0003h
COG3CON1_POLD_POSITION                   equ 0003h
COG3CON1_POLD_SIZE                       equ 0001h
COG3CON1_POLD_LENGTH                     equ 0001h
COG3CON1_POLD_MASK                       equ 0008h
COG3CON1_FDBS_POSN                       equ 0006h
COG3CON1_FDBS_POSITION                   equ 0006h
COG3CON1_FDBS_SIZE                       equ 0001h
COG3CON1_FDBS_LENGTH                     equ 0001h
COG3CON1_FDBS_MASK                       equ 0040h
COG3CON1_RDBS_POSN                       equ 0007h
COG3CON1_RDBS_POSITION                   equ 0007h
COG3CON1_RDBS_SIZE                       equ 0001h
COG3CON1_RDBS_LENGTH                     equ 0001h
COG3CON1_RDBS_MASK                       equ 0080h
COG3CON1_G3POLA_POSN                     equ 0000h
COG3CON1_G3POLA_POSITION                 equ 0000h
COG3CON1_G3POLA_SIZE                     equ 0001h
COG3CON1_G3POLA_LENGTH                   equ 0001h
COG3CON1_G3POLA_MASK                     equ 0001h
COG3CON1_G3POLB_POSN                     equ 0001h
COG3CON1_G3POLB_POSITION                 equ 0001h
COG3CON1_G3POLB_SIZE                     equ 0001h
COG3CON1_G3POLB_LENGTH                   equ 0001h
COG3CON1_G3POLB_MASK                     equ 0002h
COG3CON1_G3POLC_POSN                     equ 0002h
COG3CON1_G3POLC_POSITION                 equ 0002h
COG3CON1_G3POLC_SIZE                     equ 0001h
COG3CON1_G3POLC_LENGTH                   equ 0001h
COG3CON1_G3POLC_MASK                     equ 0004h
COG3CON1_G3POLD_POSN                     equ 0003h
COG3CON1_G3POLD_POSITION                 equ 0003h
COG3CON1_G3POLD_SIZE                     equ 0001h
COG3CON1_G3POLD_LENGTH                   equ 0001h
COG3CON1_G3POLD_MASK                     equ 0008h
COG3CON1_G3FDBS_POSN                     equ 0006h
COG3CON1_G3FDBS_POSITION                 equ 0006h
COG3CON1_G3FDBS_SIZE                     equ 0001h
COG3CON1_G3FDBS_LENGTH                   equ 0001h
COG3CON1_G3FDBS_MASK                     equ 0040h
COG3CON1_G3RDBS_POSN                     equ 0007h
COG3CON1_G3RDBS_POSITION                 equ 0007h
COG3CON1_G3RDBS_SIZE                     equ 0001h
COG3CON1_G3RDBS_LENGTH                   equ 0001h
COG3CON1_G3RDBS_MASK                     equ 0080h

