GopalSaraf/Practicals/PSDL/include/proc/pic16lf1779.inc
// Register: COG3FSIM1
#define COG3FSIM1 COG3FSIM1
COG3FSIM1                                equ 081Ch
// bitfield definitions
COG3FSIM1_FSIM9_POSN                     equ 0001h
COG3FSIM1_FSIM9_POSITION                 equ 0001h
COG3FSIM1_FSIM9_SIZE                     equ 0001h
COG3FSIM1_FSIM9_LENGTH                   equ 0001h
COG3FSIM1_FSIM9_MASK                     equ 0002h
COG3FSIM1_FSIM11_POSN                    equ 0003h
COG3FSIM1_FSIM11_POSITION                equ 0003h
COG3FSIM1_FSIM11_SIZE                    equ 0001h
COG3FSIM1_FSIM11_LENGTH                  equ 0001h
COG3FSIM1_FSIM11_MASK                    equ 0008h
COG3FSIM1_FSIM12_POSN                    equ 0004h
COG3FSIM1_FSIM12_POSITION                equ 0004h
COG3FSIM1_FSIM12_SIZE                    equ 0001h
COG3FSIM1_FSIM12_LENGTH                  equ 0001h
COG3FSIM1_FSIM12_MASK                    equ 0010h
COG3FSIM1_FSIM13_POSN                    equ 0005h
COG3FSIM1_FSIM13_POSITION                equ 0005h
COG3FSIM1_FSIM13_SIZE                    equ 0001h
COG3FSIM1_FSIM13_LENGTH                  equ 0001h
COG3FSIM1_FSIM13_MASK                    equ 0020h
COG3FSIM1_FSIM14_POSN                    equ 0006h
COG3FSIM1_FSIM14_POSITION                equ 0006h
COG3FSIM1_FSIM14_SIZE                    equ 0001h
COG3FSIM1_FSIM14_LENGTH                  equ 0001h
COG3FSIM1_FSIM14_MASK                    equ 0040h
COG3FSIM1_FSIM15_POSN                    equ 0007h
COG3FSIM1_FSIM15_POSITION                equ 0007h
COG3FSIM1_FSIM15_SIZE                    equ 0001h
COG3FSIM1_FSIM15_LENGTH                  equ 0001h
COG3FSIM1_FSIM15_MASK                    equ 0080h
COG3FSIM1_G3FSIM9_POSN                   equ 0001h
COG3FSIM1_G3FSIM9_POSITION               equ 0001h
COG3FSIM1_G3FSIM9_SIZE                   equ 0001h
COG3FSIM1_G3FSIM9_LENGTH                 equ 0001h
COG3FSIM1_G3FSIM9_MASK                   equ 0002h
COG3FSIM1_G3FSIM11_POSN                  equ 0003h
COG3FSIM1_G3FSIM11_POSITION              equ 0003h
COG3FSIM1_G3FSIM11_SIZE                  equ 0001h
COG3FSIM1_G3FSIM11_LENGTH                equ 0001h
COG3FSIM1_G3FSIM11_MASK                  equ 0008h
COG3FSIM1_G3FSIM12_POSN                  equ 0004h
COG3FSIM1_G3FSIM12_POSITION              equ 0004h
COG3FSIM1_G3FSIM12_SIZE                  equ 0001h
COG3FSIM1_G3FSIM12_LENGTH                equ 0001h
COG3FSIM1_G3FSIM12_MASK                  equ 0010h
COG3FSIM1_G3FSIM13_POSN                  equ 0005h
COG3FSIM1_G3FSIM13_POSITION              equ 0005h
COG3FSIM1_G3FSIM13_SIZE                  equ 0001h
COG3FSIM1_G3FSIM13_LENGTH                equ 0001h
COG3FSIM1_G3FSIM13_MASK                  equ 0020h
COG3FSIM1_G3FSIM14_POSN                  equ 0006h
COG3FSIM1_G3FSIM14_POSITION              equ 0006h
COG3FSIM1_G3FSIM14_SIZE                  equ 0001h
COG3FSIM1_G3FSIM14_LENGTH                equ 0001h
COG3FSIM1_G3FSIM14_MASK                  equ 0040h
COG3FSIM1_G3FSIM15_POSN                  equ 0007h
COG3FSIM1_G3FSIM15_POSITION              equ 0007h
COG3FSIM1_G3FSIM15_SIZE                  equ 0001h
COG3FSIM1_G3FSIM15_LENGTH                equ 0001h
COG3FSIM1_G3FSIM15_MASK                  equ 0080h

// Register: COG3ASD0
#define COG3ASD0 COG3ASD0
COG3ASD0                                 equ 081Dh
// bitfield definitions
COG3ASD0_ASDAC_POSN                      equ 0002h
COG3ASD0_ASDAC_POSITION                  equ 0002h
COG3ASD0_ASDAC_SIZE                      equ 0002h
COG3ASD0_ASDAC_LENGTH                    equ 0002h
COG3ASD0_ASDAC_MASK                      equ 000Ch
COG3ASD0_ASDBD_POSN                      equ 0004h
COG3ASD0_ASDBD_POSITION                  equ 0004h
COG3ASD0_ASDBD_SIZE                      equ 0002h
COG3ASD0_ASDBD_LENGTH                    equ 0002h
COG3ASD0_ASDBD_MASK                      equ 0030h
COG3ASD0_ASREN_POSN                      equ 0006h
COG3ASD0_ASREN_POSITION                  equ 0006h
COG3ASD0_ASREN_SIZE                      equ 0001h
COG3ASD0_ASREN_LENGTH                    equ 0001h
COG3ASD0_ASREN_MASK                      equ 0040h
COG3ASD0_ASE_POSN                        equ 0007h
COG3ASD0_ASE_POSITION                    equ 0007h
COG3ASD0_ASE_SIZE                        equ 0001h
COG3ASD0_ASE_LENGTH                      equ 0001h
COG3ASD0_ASE_MASK                        equ 0080h
COG3ASD0_ASDAC0_POSN                     equ 0002h
COG3ASD0_ASDAC0_POSITION                 equ 0002h
COG3ASD0_ASDAC0_SIZE                     equ 0001h
COG3ASD0_ASDAC0_LENGTH                   equ 0001h
COG3ASD0_ASDAC0_MASK                     equ 0004h
COG3ASD0_ASDAC1_POSN                     equ 0003h
COG3ASD0_ASDAC1_POSITION                 equ 0003h
COG3ASD0_ASDAC1_SIZE                     equ 0001h
COG3ASD0_ASDAC1_LENGTH                   equ 0001h
COG3ASD0_ASDAC1_MASK                     equ 0008h
COG3ASD0_ASDBD0_POSN                     equ 0004h
COG3ASD0_ASDBD0_POSITION                 equ 0004h
COG3ASD0_ASDBD0_SIZE                     equ 0001h
COG3ASD0_ASDBD0_LENGTH                   equ 0001h
COG3ASD0_ASDBD0_MASK                     equ 0010h
COG3ASD0_ASDBD1_POSN                     equ 0005h
COG3ASD0_ASDBD1_POSITION                 equ 0005h
COG3ASD0_ASDBD1_SIZE                     equ 0001h
COG3ASD0_ASDBD1_LENGTH                   equ 0001h
COG3ASD0_ASDBD1_MASK                     equ 0020h
COG3ASD0_ARSEN_POSN                      equ 0006h
COG3ASD0_ARSEN_POSITION                  equ 0006h
COG3ASD0_ARSEN_SIZE                      equ 0001h
COG3ASD0_ARSEN_LENGTH                    equ 0001h
COG3ASD0_ARSEN_MASK                      equ 0040h
COG3ASD0_G3ASDAC_POSN                    equ 0002h
COG3ASD0_G3ASDAC_POSITION                equ 0002h
COG3ASD0_G3ASDAC_SIZE                    equ 0002h
COG3ASD0_G3ASDAC_LENGTH                  equ 0002h
COG3ASD0_G3ASDAC_MASK                    equ 000Ch
COG3ASD0_G3ASDBD_POSN                    equ 0004h
COG3ASD0_G3ASDBD_POSITION                equ 0004h
COG3ASD0_G3ASDBD_SIZE                    equ 0002h
COG3ASD0_G3ASDBD_LENGTH                  equ 0002h
COG3ASD0_G3ASDBD_MASK                    equ 0030h
COG3ASD0_G3ARSEN_POSN                    equ 0006h
COG3ASD0_G3ARSEN_POSITION                equ 0006h
COG3ASD0_G3ARSEN_SIZE                    equ 0001h
COG3ASD0_G3ARSEN_LENGTH                  equ 0001h
COG3ASD0_G3ARSEN_MASK                    equ 0040h
COG3ASD0_G3ASE_POSN                      equ 0007h
COG3ASD0_G3ASE_POSITION                  equ 0007h
COG3ASD0_G3ASE_SIZE                      equ 0001h
COG3ASD0_G3ASE_LENGTH                    equ 0001h
COG3ASD0_G3ASE_MASK                      equ 0080h
COG3ASD0_G3ASDAC0_POSN                   equ 0002h
COG3ASD0_G3ASDAC0_POSITION               equ 0002h
COG3ASD0_G3ASDAC0_SIZE                   equ 0001h
COG3ASD0_G3ASDAC0_LENGTH                 equ 0001h
COG3ASD0_G3ASDAC0_MASK                   equ 0004h
COG3ASD0_G3ASDAC1_POSN                   equ 0003h
COG3ASD0_G3ASDAC1_POSITION               equ 0003h
COG3ASD0_G3ASDAC1_SIZE                   equ 0001h
COG3ASD0_G3ASDAC1_LENGTH                 equ 0001h
COG3ASD0_G3ASDAC1_MASK                   equ 0008h
COG3ASD0_G3ASDBD0_POSN                   equ 0004h
COG3ASD0_G3ASDBD0_POSITION               equ 0004h
COG3ASD0_G3ASDBD0_SIZE                   equ 0001h
COG3ASD0_G3ASDBD0_LENGTH                 equ 0001h
COG3ASD0_G3ASDBD0_MASK                   equ 0010h
COG3ASD0_G3ASDBD1_POSN                   equ 0005h
COG3ASD0_G3ASDBD1_POSITION               equ 0005h
COG3ASD0_G3ASDBD1_SIZE                   equ 0001h
COG3ASD0_G3ASDBD1_LENGTH                 equ 0001h
COG3ASD0_G3ASDBD1_MASK                   equ 0020h
COG3ASD0_G3ASREN_POSN                    equ 0006h
COG3ASD0_G3ASREN_POSITION                equ 0006h
COG3ASD0_G3ASREN_SIZE                    equ 0001h
COG3ASD0_G3ASREN_LENGTH                  equ 0001h
COG3ASD0_G3ASREN_MASK                    equ 0040h

// Register: COG3ASD1
#define COG3ASD1 COG3ASD1
COG3ASD1                                 equ 081Eh
// bitfield definitions
COG3ASD1_AS0E_POSN                       equ 0000h
COG3ASD1_AS0E_POSITION                   equ 0000h
COG3ASD1_AS0E_SIZE                       equ 0001h
COG3ASD1_AS0E_LENGTH                     equ 0001h
COG3ASD1_AS0E_MASK                       equ 0001h
COG3ASD1_AS1E_POSN                       equ 0001h
COG3ASD1_AS1E_POSITION                   equ 0001h
COG3ASD1_AS1E_SIZE                       equ 0001h
COG3ASD1_AS1E_LENGTH                     equ 0001h
COG3ASD1_AS1E_MASK                       equ 0002h
COG3ASD1_AS2E_POSN                       equ 0002h
COG3ASD1_AS2E_POSITION                   equ 0002h
COG3ASD1_AS2E_SIZE                       equ 0001h
COG3ASD1_AS2E_LENGTH                     equ 0001h
COG3ASD1_AS2E_MASK                       equ 0004h
COG3ASD1_AS3E_POSN                       equ 0003h
COG3ASD1_AS3E_POSITION                   equ 0003h
COG3ASD1_AS3E_SIZE                       equ 0001h
COG3ASD1_AS3E_LENGTH                     equ 0001h
COG3ASD1_AS3E_MASK                       equ 0008h
COG3ASD1_AS4E_POSN                       equ 0004h
COG3ASD1_AS4E_POSITION                   equ 0004h
COG3ASD1_AS4E_SIZE                       equ 0001h
COG3ASD1_AS4E_LENGTH                     equ 0001h
COG3ASD1_AS4E_MASK                       equ 0010h
COG3ASD1_AS5E_POSN                       equ 0005h
COG3ASD1_AS5E_POSITION                   equ 0005h
COG3ASD1_AS5E_SIZE                       equ 0001h
COG3ASD1_AS5E_LENGTH                     equ 0001h
COG3ASD1_AS5E_MASK                       equ 0020h
COG3ASD1_AS6E_POSN                       equ 0006h
COG3ASD1_AS6E_POSITION                   equ 0006h
COG3ASD1_AS6E_SIZE                       equ 0001h
COG3ASD1_AS6E_LENGTH                     equ 0001h
COG3ASD1_AS6E_MASK                       equ 0040h
COG3ASD1_AS7E_POSN                       equ 0007h
COG3ASD1_AS7E_POSITION                   equ 0007h
COG3ASD1_AS7E_SIZE                       equ 0001h
COG3ASD1_AS7E_LENGTH                     equ 0001h
COG3ASD1_AS7E_MASK                       equ 0080h
COG3ASD1_G3AS0E_POSN                     equ 0000h
COG3ASD1_G3AS0E_POSITION                 equ 0000h
COG3ASD1_G3AS0E_SIZE                     equ 0001h
COG3ASD1_G3AS0E_LENGTH                   equ 0001h
COG3ASD1_G3AS0E_MASK                     equ 0001h
COG3ASD1_G3AS1E_POSN                     equ 0001h
COG3ASD1_G3AS1E_POSITION                 equ 0001h
COG3ASD1_G3AS1E_SIZE                     equ 0001h
COG3ASD1_G3AS1E_LENGTH                   equ 0001h
COG3ASD1_G3AS1E_MASK                     equ 0002h
COG3ASD1_G3AS2E_POSN                     equ 0002h
COG3ASD1_G3AS2E_POSITION                 equ 0002h
COG3ASD1_G3AS2E_SIZE                     equ 0001h
COG3ASD1_G3AS2E_LENGTH                   equ 0001h
COG3ASD1_G3AS2E_MASK                     equ 0004h
COG3ASD1_G3AS3E_POSN                     equ 0003h
COG3ASD1_G3AS3E_POSITION                 equ 0003h
COG3ASD1_G3AS3E_SIZE                     equ 0001h
COG3ASD1_G3AS3E_LENGTH                   equ 0001h
COG3ASD1_G3AS3E_MASK                     equ 0008h
COG3ASD1_G3AS4E_POSN                     equ 0004h
COG3ASD1_G3AS4E_POSITION                 equ 0004h
COG3ASD1_G3AS4E_SIZE                     equ 0001h
COG3ASD1_G3AS4E_LENGTH                   equ 0001h
COG3ASD1_G3AS4E_MASK                     equ 0010h
COG3ASD1_G3AS5E_POSN                     equ 0005h
COG3ASD1_G3AS5E_POSITION                 equ 0005h
COG3ASD1_G3AS5E_SIZE                     equ 0001h
COG3ASD1_G3AS5E_LENGTH                   equ 0001h
COG3ASD1_G3AS5E_MASK                     equ 0020h
COG3ASD1_G3AS6E_POSN                     equ 0006h
COG3ASD1_G3AS6E_POSITION                 equ 0006h
COG3ASD1_G3AS6E_SIZE                     equ 0001h
COG3ASD1_G3AS6E_LENGTH                   equ 0001h
COG3ASD1_G3AS6E_MASK                     equ 0040h
COG3ASD1_G3AS7E_POSN                     equ 0007h
COG3ASD1_G3AS7E_POSITION                 equ 0007h
COG3ASD1_G3AS7E_SIZE                     equ 0001h
COG3ASD1_G3AS7E_LENGTH                   equ 0001h
COG3ASD1_G3AS7E_MASK                     equ 0080h

