GopalSaraf/Practicals/PSDL/include/proc/pic16lf1779.inc
// Register: COG4CON1
#define COG4CON1 COG4CON1
COG4CON1                                 equ 0894h
// bitfield definitions
COG4CON1_POLA_POSN                       equ 0000h
COG4CON1_POLA_POSITION                   equ 0000h
COG4CON1_POLA_SIZE                       equ 0001h
COG4CON1_POLA_LENGTH                     equ 0001h
COG4CON1_POLA_MASK                       equ 0001h
COG4CON1_POLB_POSN                       equ 0001h
COG4CON1_POLB_POSITION                   equ 0001h
COG4CON1_POLB_SIZE                       equ 0001h
COG4CON1_POLB_LENGTH                     equ 0001h
COG4CON1_POLB_MASK                       equ 0002h
COG4CON1_POLC_POSN                       equ 0002h
COG4CON1_POLC_POSITION                   equ 0002h
COG4CON1_POLC_SIZE                       equ 0001h
COG4CON1_POLC_LENGTH                     equ 0001h
COG4CON1_POLC_MASK                       equ 0004h
COG4CON1_POLD_POSN                       equ 0003h
COG4CON1_POLD_POSITION                   equ 0003h
COG4CON1_POLD_SIZE                       equ 0001h
COG4CON1_POLD_LENGTH                     equ 0001h
COG4CON1_POLD_MASK                       equ 0008h
COG4CON1_FDBS_POSN                       equ 0006h
COG4CON1_FDBS_POSITION                   equ 0006h
COG4CON1_FDBS_SIZE                       equ 0001h
COG4CON1_FDBS_LENGTH                     equ 0001h
COG4CON1_FDBS_MASK                       equ 0040h
COG4CON1_RDBS_POSN                       equ 0007h
COG4CON1_RDBS_POSITION                   equ 0007h
COG4CON1_RDBS_SIZE                       equ 0001h
COG4CON1_RDBS_LENGTH                     equ 0001h
COG4CON1_RDBS_MASK                       equ 0080h
COG4CON1_G4POLA_POSN                     equ 0000h
COG4CON1_G4POLA_POSITION                 equ 0000h
COG4CON1_G4POLA_SIZE                     equ 0001h
COG4CON1_G4POLA_LENGTH                   equ 0001h
COG4CON1_G4POLA_MASK                     equ 0001h
COG4CON1_G4POLB_POSN                     equ 0001h
COG4CON1_G4POLB_POSITION                 equ 0001h
COG4CON1_G4POLB_SIZE                     equ 0001h
COG4CON1_G4POLB_LENGTH                   equ 0001h
COG4CON1_G4POLB_MASK                     equ 0002h
COG4CON1_G4POLC_POSN                     equ 0002h
COG4CON1_G4POLC_POSITION                 equ 0002h
COG4CON1_G4POLC_SIZE                     equ 0001h
COG4CON1_G4POLC_LENGTH                   equ 0001h
COG4CON1_G4POLC_MASK                     equ 0004h
COG4CON1_G4POLD_POSN                     equ 0003h
COG4CON1_G4POLD_POSITION                 equ 0003h
COG4CON1_G4POLD_SIZE                     equ 0001h
COG4CON1_G4POLD_LENGTH                   equ 0001h
COG4CON1_G4POLD_MASK                     equ 0008h
COG4CON1_G4FDBS_POSN                     equ 0006h
COG4CON1_G4FDBS_POSITION                 equ 0006h
COG4CON1_G4FDBS_SIZE                     equ 0001h
COG4CON1_G4FDBS_LENGTH                   equ 0001h
COG4CON1_G4FDBS_MASK                     equ 0040h
COG4CON1_G4RDBS_POSN                     equ 0007h
COG4CON1_G4RDBS_POSITION                 equ 0007h
COG4CON1_G4RDBS_SIZE                     equ 0001h
COG4CON1_G4RDBS_LENGTH                   equ 0001h
COG4CON1_G4RDBS_MASK                     equ 0080h

// Register: COG4RIS0
#define COG4RIS0 COG4RIS0
COG4RIS0                                 equ 0895h
// bitfield definitions
COG4RIS0_RIS0_POSN                       equ 0000h
COG4RIS0_RIS0_POSITION                   equ 0000h
COG4RIS0_RIS0_SIZE                       equ 0001h
COG4RIS0_RIS0_LENGTH                     equ 0001h
COG4RIS0_RIS0_MASK                       equ 0001h
COG4RIS0_RIS1_POSN                       equ 0001h
COG4RIS0_RIS1_POSITION                   equ 0001h
COG4RIS0_RIS1_SIZE                       equ 0001h
COG4RIS0_RIS1_LENGTH                     equ 0001h
COG4RIS0_RIS1_MASK                       equ 0002h
COG4RIS0_RIS2_POSN                       equ 0002h
COG4RIS0_RIS2_POSITION                   equ 0002h
COG4RIS0_RIS2_SIZE                       equ 0001h
COG4RIS0_RIS2_LENGTH                     equ 0001h
COG4RIS0_RIS2_MASK                       equ 0004h
COG4RIS0_RIS3_POSN                       equ 0003h
COG4RIS0_RIS3_POSITION                   equ 0003h
COG4RIS0_RIS3_SIZE                       equ 0001h
COG4RIS0_RIS3_LENGTH                     equ 0001h
COG4RIS0_RIS3_MASK                       equ 0008h
COG4RIS0_RIS4_POSN                       equ 0004h
COG4RIS0_RIS4_POSITION                   equ 0004h
COG4RIS0_RIS4_SIZE                       equ 0001h
COG4RIS0_RIS4_LENGTH                     equ 0001h
COG4RIS0_RIS4_MASK                       equ 0010h
COG4RIS0_RIS5_POSN                       equ 0005h
COG4RIS0_RIS5_POSITION                   equ 0005h
COG4RIS0_RIS5_SIZE                       equ 0001h
COG4RIS0_RIS5_LENGTH                     equ 0001h
COG4RIS0_RIS5_MASK                       equ 0020h
COG4RIS0_RIS6_POSN                       equ 0006h
COG4RIS0_RIS6_POSITION                   equ 0006h
COG4RIS0_RIS6_SIZE                       equ 0001h
COG4RIS0_RIS6_LENGTH                     equ 0001h
COG4RIS0_RIS6_MASK                       equ 0040h
COG4RIS0_RIS7_POSN                       equ 0007h
COG4RIS0_RIS7_POSITION                   equ 0007h
COG4RIS0_RIS7_SIZE                       equ 0001h
COG4RIS0_RIS7_LENGTH                     equ 0001h
COG4RIS0_RIS7_MASK                       equ 0080h
COG4RIS0_G4RIS0_POSN                     equ 0000h
COG4RIS0_G4RIS0_POSITION                 equ 0000h
COG4RIS0_G4RIS0_SIZE                     equ 0001h
COG4RIS0_G4RIS0_LENGTH                   equ 0001h
COG4RIS0_G4RIS0_MASK                     equ 0001h
COG4RIS0_G4RIS1_POSN                     equ 0001h
COG4RIS0_G4RIS1_POSITION                 equ 0001h
COG4RIS0_G4RIS1_SIZE                     equ 0001h
COG4RIS0_G4RIS1_LENGTH                   equ 0001h
COG4RIS0_G4RIS1_MASK                     equ 0002h
COG4RIS0_G4RIS2_POSN                     equ 0002h
COG4RIS0_G4RIS2_POSITION                 equ 0002h
COG4RIS0_G4RIS2_SIZE                     equ 0001h
COG4RIS0_G4RIS2_LENGTH                   equ 0001h
COG4RIS0_G4RIS2_MASK                     equ 0004h
COG4RIS0_G4RIS3_POSN                     equ 0003h
COG4RIS0_G4RIS3_POSITION                 equ 0003h
COG4RIS0_G4RIS3_SIZE                     equ 0001h
COG4RIS0_G4RIS3_LENGTH                   equ 0001h
COG4RIS0_G4RIS3_MASK                     equ 0008h
COG4RIS0_G4RIS4_POSN                     equ 0004h
COG4RIS0_G4RIS4_POSITION                 equ 0004h
COG4RIS0_G4RIS4_SIZE                     equ 0001h
COG4RIS0_G4RIS4_LENGTH                   equ 0001h
COG4RIS0_G4RIS4_MASK                     equ 0010h
COG4RIS0_G4RIS5_POSN                     equ 0005h
COG4RIS0_G4RIS5_POSITION                 equ 0005h
COG4RIS0_G4RIS5_SIZE                     equ 0001h
COG4RIS0_G4RIS5_LENGTH                   equ 0001h
COG4RIS0_G4RIS5_MASK                     equ 0020h
COG4RIS0_G4RIS6_POSN                     equ 0006h
COG4RIS0_G4RIS6_POSITION                 equ 0006h
COG4RIS0_G4RIS6_SIZE                     equ 0001h
COG4RIS0_G4RIS6_LENGTH                   equ 0001h
COG4RIS0_G4RIS6_MASK                     equ 0040h
COG4RIS0_G4RIS7_POSN                     equ 0007h
COG4RIS0_G4RIS7_POSITION                 equ 0007h
COG4RIS0_G4RIS7_SIZE                     equ 0001h
COG4RIS0_G4RIS7_LENGTH                   equ 0001h
COG4RIS0_G4RIS7_MASK                     equ 0080h

// Register: COG4RIS1
#define COG4RIS1 COG4RIS1
COG4RIS1                                 equ 0896h
// bitfield definitions
COG4RIS1_RIS8_POSN                       equ 0000h
COG4RIS1_RIS8_POSITION                   equ 0000h
COG4RIS1_RIS8_SIZE                       equ 0001h
COG4RIS1_RIS8_LENGTH                     equ 0001h
COG4RIS1_RIS8_MASK                       equ 0001h
COG4RIS1_RIS9_POSN                       equ 0001h
COG4RIS1_RIS9_POSITION                   equ 0001h
COG4RIS1_RIS9_SIZE                       equ 0001h
COG4RIS1_RIS9_LENGTH                     equ 0001h
COG4RIS1_RIS9_MASK                       equ 0002h
COG4RIS1_RIS10_POSN                      equ 0002h
COG4RIS1_RIS10_POSITION                  equ 0002h
COG4RIS1_RIS10_SIZE                      equ 0001h
COG4RIS1_RIS10_LENGTH                    equ 0001h
COG4RIS1_RIS10_MASK                      equ 0004h
COG4RIS1_RIS11_POSN                      equ 0003h
COG4RIS1_RIS11_POSITION                  equ 0003h
COG4RIS1_RIS11_SIZE                      equ 0001h
COG4RIS1_RIS11_LENGTH                    equ 0001h
COG4RIS1_RIS11_MASK                      equ 0008h
COG4RIS1_RIS12_POSN                      equ 0004h
COG4RIS1_RIS12_POSITION                  equ 0004h
COG4RIS1_RIS12_SIZE                      equ 0001h
COG4RIS1_RIS12_LENGTH                    equ 0001h
COG4RIS1_RIS12_MASK                      equ 0010h
COG4RIS1_RIS13_POSN                      equ 0005h
COG4RIS1_RIS13_POSITION                  equ 0005h
COG4RIS1_RIS13_SIZE                      equ 0001h
COG4RIS1_RIS13_LENGTH                    equ 0001h
COG4RIS1_RIS13_MASK                      equ 0020h
COG4RIS1_RIS14_POSN                      equ 0006h
COG4RIS1_RIS14_POSITION                  equ 0006h
COG4RIS1_RIS14_SIZE                      equ 0001h
COG4RIS1_RIS14_LENGTH                    equ 0001h
COG4RIS1_RIS14_MASK                      equ 0040h
COG4RIS1_RIS15_POSN                      equ 0007h
COG4RIS1_RIS15_POSITION                  equ 0007h
COG4RIS1_RIS15_SIZE                      equ 0001h
COG4RIS1_RIS15_LENGTH                    equ 0001h
COG4RIS1_RIS15_MASK                      equ 0080h
COG4RIS1_G4RIS8_POSN                     equ 0000h
COG4RIS1_G4RIS8_POSITION                 equ 0000h
COG4RIS1_G4RIS8_SIZE                     equ 0001h
COG4RIS1_G4RIS8_LENGTH                   equ 0001h
COG4RIS1_G4RIS8_MASK                     equ 0001h
COG4RIS1_G4RIS9_POSN                     equ 0001h
COG4RIS1_G4RIS9_POSITION                 equ 0001h
COG4RIS1_G4RIS9_SIZE                     equ 0001h
COG4RIS1_G4RIS9_LENGTH                   equ 0001h
COG4RIS1_G4RIS9_MASK                     equ 0002h
COG4RIS1_G4RIS10_POSN                    equ 0002h
COG4RIS1_G4RIS10_POSITION                equ 0002h
COG4RIS1_G4RIS10_SIZE                    equ 0001h
COG4RIS1_G4RIS10_LENGTH                  equ 0001h
COG4RIS1_G4RIS10_MASK                    equ 0004h
COG4RIS1_G4RIS11_POSN                    equ 0003h
COG4RIS1_G4RIS11_POSITION                equ 0003h
COG4RIS1_G4RIS11_SIZE                    equ 0001h
COG4RIS1_G4RIS11_LENGTH                  equ 0001h
COG4RIS1_G4RIS11_MASK                    equ 0008h
COG4RIS1_G4RIS12_POSN                    equ 0004h
COG4RIS1_G4RIS12_POSITION                equ 0004h
COG4RIS1_G4RIS12_SIZE                    equ 0001h
COG4RIS1_G4RIS12_LENGTH                  equ 0001h
COG4RIS1_G4RIS12_MASK                    equ 0010h
COG4RIS1_G4RIS13_POSN                    equ 0005h
COG4RIS1_G4RIS13_POSITION                equ 0005h
COG4RIS1_G4RIS13_SIZE                    equ 0001h
COG4RIS1_G4RIS13_LENGTH                  equ 0001h
COG4RIS1_G4RIS13_MASK                    equ 0020h
COG4RIS1_G4RIS14_POSN                    equ 0006h
COG4RIS1_G4RIS14_POSITION                equ 0006h
COG4RIS1_G4RIS14_SIZE                    equ 0001h
COG4RIS1_G4RIS14_LENGTH                  equ 0001h
COG4RIS1_G4RIS14_MASK                    equ 0040h
COG4RIS1_G4RIS15_POSN                    equ 0007h
COG4RIS1_G4RIS15_POSITION                equ 0007h
COG4RIS1_G4RIS15_SIZE                    equ 0001h
COG4RIS1_G4RIS15_LENGTH                  equ 0001h
COG4RIS1_G4RIS15_MASK                    equ 0080h

