GopalSaraf/Practicals/PSDL/include/proc/pic16lf1779.inc
// Register: CM8CON1
#define CM8CON1 CM8CON1
CM8CON1                                  equ 091Dh
// bitfield definitions
CM8CON1_INTN_POSN                        equ 0000h
CM8CON1_INTN_POSITION                    equ 0000h
CM8CON1_INTN_SIZE                        equ 0001h
CM8CON1_INTN_LENGTH                      equ 0001h
CM8CON1_INTN_MASK                        equ 0001h
CM8CON1_INTP_POSN                        equ 0001h
CM8CON1_INTP_POSITION                    equ 0001h
CM8CON1_INTP_SIZE                        equ 0001h
CM8CON1_INTP_LENGTH                      equ 0001h
CM8CON1_INTP_MASK                        equ 0002h
CM8CON1_C8INTN_POSN                      equ 0000h
CM8CON1_C8INTN_POSITION                  equ 0000h
CM8CON1_C8INTN_SIZE                      equ 0001h
CM8CON1_C8INTN_LENGTH                    equ 0001h
CM8CON1_C8INTN_MASK                      equ 0001h
CM8CON1_C8INTP_POSN                      equ 0001h
CM8CON1_C8INTP_POSITION                  equ 0001h
CM8CON1_C8INTP_SIZE                      equ 0001h
CM8CON1_C8INTP_LENGTH                    equ 0001h
CM8CON1_C8INTP_MASK                      equ 0002h

// Register: CM8NSEL
#define CM8NSEL CM8NSEL
CM8NSEL                                  equ 091Eh
// bitfield definitions
CM8NSEL_NCH_POSN                         equ 0000h
CM8NSEL_NCH_POSITION                     equ 0000h
CM8NSEL_NCH_SIZE                         equ 0004h
CM8NSEL_NCH_LENGTH                       equ 0004h
CM8NSEL_NCH_MASK                         equ 000Fh
CM8NSEL_C8NCH_POSN                       equ 0000h
CM8NSEL_C8NCH_POSITION                   equ 0000h
CM8NSEL_C8NCH_SIZE                       equ 0004h
CM8NSEL_C8NCH_LENGTH                     equ 0004h
CM8NSEL_C8NCH_MASK                       equ 000Fh
CM8NSEL_C8NCH0_POSN                      equ 0000h
CM8NSEL_C8NCH0_POSITION                  equ 0000h
CM8NSEL_C8NCH0_SIZE                      equ 0001h
CM8NSEL_C8NCH0_LENGTH                    equ 0001h
CM8NSEL_C8NCH0_MASK                      equ 0001h
CM8NSEL_C8NCH1_POSN                      equ 0001h
CM8NSEL_C8NCH1_POSITION                  equ 0001h
CM8NSEL_C8NCH1_SIZE                      equ 0001h
CM8NSEL_C8NCH1_LENGTH                    equ 0001h
CM8NSEL_C8NCH1_MASK                      equ 0002h
CM8NSEL_C8NCH2_POSN                      equ 0002h
CM8NSEL_C8NCH2_POSITION                  equ 0002h
CM8NSEL_C8NCH2_SIZE                      equ 0001h
CM8NSEL_C8NCH2_LENGTH                    equ 0001h
CM8NSEL_C8NCH2_MASK                      equ 0004h
CM8NSEL_C8NCH3_POSN                      equ 0003h
CM8NSEL_C8NCH3_POSITION                  equ 0003h
CM8NSEL_C8NCH3_SIZE                      equ 0001h
CM8NSEL_C8NCH3_LENGTH                    equ 0001h
CM8NSEL_C8NCH3_MASK                      equ 0008h

// Register: CM8PSEL
#define CM8PSEL CM8PSEL
CM8PSEL                                  equ 091Fh
// bitfield definitions
CM8PSEL_PCH_POSN                         equ 0000h
CM8PSEL_PCH_POSITION                     equ 0000h
CM8PSEL_PCH_SIZE                         equ 0004h
CM8PSEL_PCH_LENGTH                       equ 0004h
CM8PSEL_PCH_MASK                         equ 000Fh
CM8PSEL_PCH0_POSN                        equ 0000h
CM8PSEL_PCH0_POSITION                    equ 0000h
CM8PSEL_PCH0_SIZE                        equ 0001h
CM8PSEL_PCH0_LENGTH                      equ 0001h
CM8PSEL_PCH0_MASK                        equ 0001h
CM8PSEL_PCH1_POSN                        equ 0001h
CM8PSEL_PCH1_POSITION                    equ 0001h
CM8PSEL_PCH1_SIZE                        equ 0001h
CM8PSEL_PCH1_LENGTH                      equ 0001h
CM8PSEL_PCH1_MASK                        equ 0002h
CM8PSEL_PCH2_POSN                        equ 0002h
CM8PSEL_PCH2_POSITION                    equ 0002h
CM8PSEL_PCH2_SIZE                        equ 0001h
CM8PSEL_PCH2_LENGTH                      equ 0001h
CM8PSEL_PCH2_MASK                        equ 0004h
CM8PSEL_PCH3_POSN                        equ 0003h
CM8PSEL_PCH3_POSITION                    equ 0003h
CM8PSEL_PCH3_SIZE                        equ 0001h
CM8PSEL_PCH3_LENGTH                      equ 0001h
CM8PSEL_PCH3_MASK                        equ 0008h
CM8PSEL_C8PCH_POSN                       equ 0000h
CM8PSEL_C8PCH_POSITION                   equ 0000h
CM8PSEL_C8PCH_SIZE                       equ 0004h
CM8PSEL_C8PCH_LENGTH                     equ 0004h
CM8PSEL_C8PCH_MASK                       equ 000Fh
CM8PSEL_C8PCH0_POSN                      equ 0000h
CM8PSEL_C8PCH0_POSITION                  equ 0000h
CM8PSEL_C8PCH0_SIZE                      equ 0001h
CM8PSEL_C8PCH0_LENGTH                    equ 0001h
CM8PSEL_C8PCH0_MASK                      equ 0001h
CM8PSEL_C8PCH1_POSN                      equ 0001h
CM8PSEL_C8PCH1_POSITION                  equ 0001h
CM8PSEL_C8PCH1_SIZE                      equ 0001h
CM8PSEL_C8PCH1_LENGTH                    equ 0001h
CM8PSEL_C8PCH1_MASK                      equ 0002h
CM8PSEL_C8PCH2_POSN                      equ 0002h
CM8PSEL_C8PCH2_POSITION                  equ 0002h
CM8PSEL_C8PCH2_SIZE                      equ 0001h
CM8PSEL_C8PCH2_LENGTH                    equ 0001h
CM8PSEL_C8PCH2_MASK                      equ 0004h
CM8PSEL_C8PCH3_POSN                      equ 0003h
CM8PSEL_C8PCH3_POSITION                  equ 0003h
CM8PSEL_C8PCH3_SIZE                      equ 0001h
CM8PSEL_C8PCH3_LENGTH                    equ 0001h
CM8PSEL_C8PCH3_MASK                      equ 0008h

// Register: MD4CON0
#define MD4CON0 MD4CON0
MD4CON0                                  equ 0D1Bh
// bitfield definitions
MD4CON0_BIT_POSN                         equ 0000h
MD4CON0_BIT_POSITION                     equ 0000h
MD4CON0_BIT_SIZE                         equ 0001h
MD4CON0_BIT_LENGTH                       equ 0001h
MD4CON0_BIT_MASK                         equ 0001h
MD4CON0_OPOL_POSN                        equ 0004h
MD4CON0_OPOL_POSITION                    equ 0004h
MD4CON0_OPOL_SIZE                        equ 0001h
MD4CON0_OPOL_LENGTH                      equ 0001h
MD4CON0_OPOL_MASK                        equ 0010h
MD4CON0_OUT_POSN                         equ 0005h
MD4CON0_OUT_POSITION                     equ 0005h
MD4CON0_OUT_SIZE                         equ 0001h
MD4CON0_OUT_LENGTH                       equ 0001h
MD4CON0_OUT_MASK                         equ 0020h
MD4CON0_EN_POSN                          equ 0007h
MD4CON0_EN_POSITION                      equ 0007h
MD4CON0_EN_SIZE                          equ 0001h
MD4CON0_EN_LENGTH                        equ 0001h
MD4CON0_EN_MASK                          equ 0080h
MD4CON0_MD4BIT_POSN                      equ 0000h
MD4CON0_MD4BIT_POSITION                  equ 0000h
MD4CON0_MD4BIT_SIZE                      equ 0001h
MD4CON0_MD4BIT_LENGTH                    equ 0001h
MD4CON0_MD4BIT_MASK                      equ 0001h
MD4CON0_MD4OPOL_POSN                     equ 0004h
MD4CON0_MD4OPOL_POSITION                 equ 0004h
MD4CON0_MD4OPOL_SIZE                     equ 0001h
MD4CON0_MD4OPOL_LENGTH                   equ 0001h
MD4CON0_MD4OPOL_MASK                     equ 0010h
MD4CON0_MD4OUT_POSN                      equ 0005h
MD4CON0_MD4OUT_POSITION                  equ 0005h
MD4CON0_MD4OUT_SIZE                      equ 0001h
MD4CON0_MD4OUT_LENGTH                    equ 0001h
MD4CON0_MD4OUT_MASK                      equ 0020h
MD4CON0_MD4EN_POSN                       equ 0007h
MD4CON0_MD4EN_POSITION                   equ 0007h
MD4CON0_MD4EN_SIZE                       equ 0001h
MD4CON0_MD4EN_LENGTH                     equ 0001h
MD4CON0_MD4EN_MASK                       equ 0080h

