GopalSaraf/Practicals/PSDL/include/proc/pic16lf1779.inc
// Register: PWM12DCL
#define PWM12DCL PWM12DCL
PWM12DCL                                 equ 0DC3h
// bitfield definitions
PWM12DCL_DC_POSN                         equ 0000h
PWM12DCL_DC_POSITION                     equ 0000h
PWM12DCL_DC_SIZE                         equ 0008h
PWM12DCL_DC_LENGTH                       equ 0008h
PWM12DCL_DC_MASK                         equ 00FFh
PWM12DCL_PWM12DCL0_POSN                  equ 0000h
PWM12DCL_PWM12DCL0_POSITION              equ 0000h
PWM12DCL_PWM12DCL0_SIZE                  equ 0001h
PWM12DCL_PWM12DCL0_LENGTH                equ 0001h
PWM12DCL_PWM12DCL0_MASK                  equ 0001h
PWM12DCL_PWM12DCL1_POSN                  equ 0001h
PWM12DCL_PWM12DCL1_POSITION              equ 0001h
PWM12DCL_PWM12DCL1_SIZE                  equ 0001h
PWM12DCL_PWM12DCL1_LENGTH                equ 0001h
PWM12DCL_PWM12DCL1_MASK                  equ 0002h
PWM12DCL_PWM12DCL2_POSN                  equ 0002h
PWM12DCL_PWM12DCL2_POSITION              equ 0002h
PWM12DCL_PWM12DCL2_SIZE                  equ 0001h
PWM12DCL_PWM12DCL2_LENGTH                equ 0001h
PWM12DCL_PWM12DCL2_MASK                  equ 0004h
PWM12DCL_PWM12DCL3_POSN                  equ 0003h
PWM12DCL_PWM12DCL3_POSITION              equ 0003h
PWM12DCL_PWM12DCL3_SIZE                  equ 0001h
PWM12DCL_PWM12DCL3_LENGTH                equ 0001h
PWM12DCL_PWM12DCL3_MASK                  equ 0008h
PWM12DCL_PWM12DCL4_POSN                  equ 0004h
PWM12DCL_PWM12DCL4_POSITION              equ 0004h
PWM12DCL_PWM12DCL4_SIZE                  equ 0001h
PWM12DCL_PWM12DCL4_LENGTH                equ 0001h
PWM12DCL_PWM12DCL4_MASK                  equ 0010h
PWM12DCL_PWM12DCL5_POSN                  equ 0005h
PWM12DCL_PWM12DCL5_POSITION              equ 0005h
PWM12DCL_PWM12DCL5_SIZE                  equ 0001h
PWM12DCL_PWM12DCL5_LENGTH                equ 0001h
PWM12DCL_PWM12DCL5_MASK                  equ 0020h
PWM12DCL_PWM12DCL6_POSN                  equ 0006h
PWM12DCL_PWM12DCL6_POSITION              equ 0006h
PWM12DCL_PWM12DCL6_SIZE                  equ 0001h
PWM12DCL_PWM12DCL6_LENGTH                equ 0001h
PWM12DCL_PWM12DCL6_MASK                  equ 0040h
PWM12DCL_PWM12DCL7_POSN                  equ 0007h
PWM12DCL_PWM12DCL7_POSITION              equ 0007h
PWM12DCL_PWM12DCL7_SIZE                  equ 0001h
PWM12DCL_PWM12DCL7_LENGTH                equ 0001h
PWM12DCL_PWM12DCL7_MASK                  equ 0080h
PWM12DCL_PWM12DCL_POSN                   equ 0000h
PWM12DCL_PWM12DCL_POSITION               equ 0000h
PWM12DCL_PWM12DCL_SIZE                   equ 0008h
PWM12DCL_PWM12DCL_LENGTH                 equ 0008h
PWM12DCL_PWM12DCL_MASK                   equ 00FFh

// Register: PWM12DCH
#define PWM12DCH PWM12DCH
PWM12DCH                                 equ 0DC4h
// bitfield definitions
PWM12DCH_DC_POSN                         equ 0000h
PWM12DCH_DC_POSITION                     equ 0000h
PWM12DCH_DC_SIZE                         equ 0008h
PWM12DCH_DC_LENGTH                       equ 0008h
PWM12DCH_DC_MASK                         equ 00FFh
PWM12DCH_PWM12DCH0_POSN                  equ 0000h
PWM12DCH_PWM12DCH0_POSITION              equ 0000h
PWM12DCH_PWM12DCH0_SIZE                  equ 0001h
PWM12DCH_PWM12DCH0_LENGTH                equ 0001h
PWM12DCH_PWM12DCH0_MASK                  equ 0001h
PWM12DCH_PWM12DCH1_POSN                  equ 0001h
PWM12DCH_PWM12DCH1_POSITION              equ 0001h
PWM12DCH_PWM12DCH1_SIZE                  equ 0001h
PWM12DCH_PWM12DCH1_LENGTH                equ 0001h
PWM12DCH_PWM12DCH1_MASK                  equ 0002h
PWM12DCH_PWM12DCH2_POSN                  equ 0002h
PWM12DCH_PWM12DCH2_POSITION              equ 0002h
PWM12DCH_PWM12DCH2_SIZE                  equ 0001h
PWM12DCH_PWM12DCH2_LENGTH                equ 0001h
PWM12DCH_PWM12DCH2_MASK                  equ 0004h
PWM12DCH_PWM12DCH3_POSN                  equ 0003h
PWM12DCH_PWM12DCH3_POSITION              equ 0003h
PWM12DCH_PWM12DCH3_SIZE                  equ 0001h
PWM12DCH_PWM12DCH3_LENGTH                equ 0001h
PWM12DCH_PWM12DCH3_MASK                  equ 0008h
PWM12DCH_PWM12DCH4_POSN                  equ 0004h
PWM12DCH_PWM12DCH4_POSITION              equ 0004h
PWM12DCH_PWM12DCH4_SIZE                  equ 0001h
PWM12DCH_PWM12DCH4_LENGTH                equ 0001h
PWM12DCH_PWM12DCH4_MASK                  equ 0010h
PWM12DCH_PWM12DCH5_POSN                  equ 0005h
PWM12DCH_PWM12DCH5_POSITION              equ 0005h
PWM12DCH_PWM12DCH5_SIZE                  equ 0001h
PWM12DCH_PWM12DCH5_LENGTH                equ 0001h
PWM12DCH_PWM12DCH5_MASK                  equ 0020h
PWM12DCH_PWM12DCH6_POSN                  equ 0006h
PWM12DCH_PWM12DCH6_POSITION              equ 0006h
PWM12DCH_PWM12DCH6_SIZE                  equ 0001h
PWM12DCH_PWM12DCH6_LENGTH                equ 0001h
PWM12DCH_PWM12DCH6_MASK                  equ 0040h
PWM12DCH_PWM12DCH7_POSN                  equ 0007h
PWM12DCH_PWM12DCH7_POSITION              equ 0007h
PWM12DCH_PWM12DCH7_SIZE                  equ 0001h
PWM12DCH_PWM12DCH7_LENGTH                equ 0001h
PWM12DCH_PWM12DCH7_MASK                  equ 0080h
PWM12DCH_PWM12DCH_POSN                   equ 0000h
PWM12DCH_PWM12DCH_POSITION               equ 0000h
PWM12DCH_PWM12DCH_SIZE                   equ 0008h
PWM12DCH_PWM12DCH_LENGTH                 equ 0008h
PWM12DCH_PWM12DCH_MASK                   equ 00FFh

// Register: PWM12PRL
#define PWM12PRL PWM12PRL
PWM12PRL                                 equ 0DC5h
// bitfield definitions
PWM12PRL_PR_POSN                         equ 0000h
PWM12PRL_PR_POSITION                     equ 0000h
PWM12PRL_PR_SIZE                         equ 0008h
PWM12PRL_PR_LENGTH                       equ 0008h
PWM12PRL_PR_MASK                         equ 00FFh
PWM12PRL_PWM12PRL0_POSN                  equ 0000h
PWM12PRL_PWM12PRL0_POSITION              equ 0000h
PWM12PRL_PWM12PRL0_SIZE                  equ 0001h
PWM12PRL_PWM12PRL0_LENGTH                equ 0001h
PWM12PRL_PWM12PRL0_MASK                  equ 0001h
PWM12PRL_PWM12PRL1_POSN                  equ 0001h
PWM12PRL_PWM12PRL1_POSITION              equ 0001h
PWM12PRL_PWM12PRL1_SIZE                  equ 0001h
PWM12PRL_PWM12PRL1_LENGTH                equ 0001h
PWM12PRL_PWM12PRL1_MASK                  equ 0002h
PWM12PRL_PWM12PRL2_POSN                  equ 0002h
PWM12PRL_PWM12PRL2_POSITION              equ 0002h
PWM12PRL_PWM12PRL2_SIZE                  equ 0001h
PWM12PRL_PWM12PRL2_LENGTH                equ 0001h
PWM12PRL_PWM12PRL2_MASK                  equ 0004h
PWM12PRL_PWM12PRL3_POSN                  equ 0003h
PWM12PRL_PWM12PRL3_POSITION              equ 0003h
PWM12PRL_PWM12PRL3_SIZE                  equ 0001h
PWM12PRL_PWM12PRL3_LENGTH                equ 0001h
PWM12PRL_PWM12PRL3_MASK                  equ 0008h
PWM12PRL_PWM12PRL4_POSN                  equ 0004h
PWM12PRL_PWM12PRL4_POSITION              equ 0004h
PWM12PRL_PWM12PRL4_SIZE                  equ 0001h
PWM12PRL_PWM12PRL4_LENGTH                equ 0001h
PWM12PRL_PWM12PRL4_MASK                  equ 0010h
PWM12PRL_PWM12PRL5_POSN                  equ 0005h
PWM12PRL_PWM12PRL5_POSITION              equ 0005h
PWM12PRL_PWM12PRL5_SIZE                  equ 0001h
PWM12PRL_PWM12PRL5_LENGTH                equ 0001h
PWM12PRL_PWM12PRL5_MASK                  equ 0020h
PWM12PRL_PWM12PRL6_POSN                  equ 0006h
PWM12PRL_PWM12PRL6_POSITION              equ 0006h
PWM12PRL_PWM12PRL6_SIZE                  equ 0001h
PWM12PRL_PWM12PRL6_LENGTH                equ 0001h
PWM12PRL_PWM12PRL6_MASK                  equ 0040h
PWM12PRL_PWM12PRL7_POSN                  equ 0007h
PWM12PRL_PWM12PRL7_POSITION              equ 0007h
PWM12PRL_PWM12PRL7_SIZE                  equ 0001h
PWM12PRL_PWM12PRL7_LENGTH                equ 0001h
PWM12PRL_PWM12PRL7_MASK                  equ 0080h
PWM12PRL_PWM12PRL_POSN                   equ 0000h
PWM12PRL_PWM12PRL_POSITION               equ 0000h
PWM12PRL_PWM12PRL_SIZE                   equ 0008h
PWM12PRL_PWM12PRL_LENGTH                 equ 0008h
PWM12PRL_PWM12PRL_MASK                   equ 00FFh

// Register: PWM12PRH
#define PWM12PRH PWM12PRH
PWM12PRH                                 equ 0DC6h
// bitfield definitions
PWM12PRH_PR_POSN                         equ 0000h
PWM12PRH_PR_POSITION                     equ 0000h
PWM12PRH_PR_SIZE                         equ 0008h
PWM12PRH_PR_LENGTH                       equ 0008h
PWM12PRH_PR_MASK                         equ 00FFh
PWM12PRH_PWM12PRH0_POSN                  equ 0000h
PWM12PRH_PWM12PRH0_POSITION              equ 0000h
PWM12PRH_PWM12PRH0_SIZE                  equ 0001h
PWM12PRH_PWM12PRH0_LENGTH                equ 0001h
PWM12PRH_PWM12PRH0_MASK                  equ 0001h
PWM12PRH_PWM12PRH1_POSN                  equ 0001h
PWM12PRH_PWM12PRH1_POSITION              equ 0001h
PWM12PRH_PWM12PRH1_SIZE                  equ 0001h
PWM12PRH_PWM12PRH1_LENGTH                equ 0001h
PWM12PRH_PWM12PRH1_MASK                  equ 0002h
PWM12PRH_PWM12PRH2_POSN                  equ 0002h
PWM12PRH_PWM12PRH2_POSITION              equ 0002h
PWM12PRH_PWM12PRH2_SIZE                  equ 0001h
PWM12PRH_PWM12PRH2_LENGTH                equ 0001h
PWM12PRH_PWM12PRH2_MASK                  equ 0004h
PWM12PRH_PWM12PRH3_POSN                  equ 0003h
PWM12PRH_PWM12PRH3_POSITION              equ 0003h
PWM12PRH_PWM12PRH3_SIZE                  equ 0001h
PWM12PRH_PWM12PRH3_LENGTH                equ 0001h
PWM12PRH_PWM12PRH3_MASK                  equ 0008h
PWM12PRH_PWM12PRH4_POSN                  equ 0004h
PWM12PRH_PWM12PRH4_POSITION              equ 0004h
PWM12PRH_PWM12PRH4_SIZE                  equ 0001h
PWM12PRH_PWM12PRH4_LENGTH                equ 0001h
PWM12PRH_PWM12PRH4_MASK                  equ 0010h
PWM12PRH_PWM12PRH5_POSN                  equ 0005h
PWM12PRH_PWM12PRH5_POSITION              equ 0005h
PWM12PRH_PWM12PRH5_SIZE                  equ 0001h
PWM12PRH_PWM12PRH5_LENGTH                equ 0001h
PWM12PRH_PWM12PRH5_MASK                  equ 0020h
PWM12PRH_PWM12PRH6_POSN                  equ 0006h
PWM12PRH_PWM12PRH6_POSITION              equ 0006h
PWM12PRH_PWM12PRH6_SIZE                  equ 0001h
PWM12PRH_PWM12PRH6_LENGTH                equ 0001h
PWM12PRH_PWM12PRH6_MASK                  equ 0040h
PWM12PRH_PWM12PRH7_POSN                  equ 0007h
PWM12PRH_PWM12PRH7_POSITION              equ 0007h
PWM12PRH_PWM12PRH7_SIZE                  equ 0001h
PWM12PRH_PWM12PRH7_LENGTH                equ 0001h
PWM12PRH_PWM12PRH7_MASK                  equ 0080h
PWM12PRH_PWM12PRH_POSN                   equ 0000h
PWM12PRH_PWM12PRH_POSITION               equ 0000h
PWM12PRH_PWM12PRH_SIZE                   equ 0008h
PWM12PRH_PWM12PRH_LENGTH                 equ 0008h
PWM12PRH_PWM12PRH_MASK                   equ 00FFh

