GopalSaraf/Practicals/PSDL/include/proc/pic16lf1779.inc
// Register: T3CKIPPS
#define T3CKIPPS T3CKIPPS
T3CKIPPS                                 equ 0E11h
// bitfield definitions
T3CKIPPS_T3CKIPPS_POSN                   equ 0000h
T3CKIPPS_T3CKIPPS_POSITION               equ 0000h
T3CKIPPS_T3CKIPPS_SIZE                   equ 0006h
T3CKIPPS_T3CKIPPS_LENGTH                 equ 0006h
T3CKIPPS_T3CKIPPS_MASK                   equ 003Fh

// Register: T3GPPS
#define T3GPPS T3GPPS
T3GPPS                                   equ 0E12h
// bitfield definitions
T3GPPS_T3GPPS_POSN                       equ 0000h
T3GPPS_T3GPPS_POSITION                   equ 0000h
T3GPPS_T3GPPS_SIZE                       equ 0006h
T3GPPS_T3GPPS_LENGTH                     equ 0006h
T3GPPS_T3GPPS_MASK                       equ 003Fh

// Register: T5CKIPPS
#define T5CKIPPS T5CKIPPS
T5CKIPPS                                 equ 0E13h
// bitfield definitions
T5CKIPPS_T5CKIPPS_POSN                   equ 0000h
T5CKIPPS_T5CKIPPS_POSITION               equ 0000h
T5CKIPPS_T5CKIPPS_SIZE                   equ 0006h
T5CKIPPS_T5CKIPPS_LENGTH                 equ 0006h
T5CKIPPS_T5CKIPPS_MASK                   equ 003Fh

// Register: T5GPPS
#define T5GPPS T5GPPS
T5GPPS                                   equ 0E14h
// bitfield definitions
T5GPPS_T5GPPS_POSN                       equ 0000h
T5GPPS_T5GPPS_POSITION                   equ 0000h
T5GPPS_T5GPPS_SIZE                       equ 0006h
T5GPPS_T5GPPS_LENGTH                     equ 0006h
T5GPPS_T5GPPS_MASK                       equ 003Fh

// Register: T2INPPS
#define T2INPPS T2INPPS
T2INPPS                                  equ 0E15h
// bitfield definitions
T2INPPS_T2INPPS_POSN                     equ 0000h
T2INPPS_T2INPPS_POSITION                 equ 0000h
T2INPPS_T2INPPS_SIZE                     equ 0006h
T2INPPS_T2INPPS_LENGTH                   equ 0006h
T2INPPS_T2INPPS_MASK                     equ 003Fh

// Register: T4INPPS
#define T4INPPS T4INPPS
T4INPPS                                  equ 0E16h
// bitfield definitions
T4INPPS_T4INPPS_POSN                     equ 0000h
T4INPPS_T4INPPS_POSITION                 equ 0000h
T4INPPS_T4INPPS_SIZE                     equ 0006h
T4INPPS_T4INPPS_LENGTH                   equ 0006h
T4INPPS_T4INPPS_MASK                     equ 003Fh

// Register: T6INPPS
#define T6INPPS T6INPPS
T6INPPS                                  equ 0E17h
// bitfield definitions
T6INPPS_T6INPPS_POSN                     equ 0000h
T6INPPS_T6INPPS_POSITION                 equ 0000h
T6INPPS_T6INPPS_SIZE                     equ 0006h
T6INPPS_T6INPPS_LENGTH                   equ 0006h
T6INPPS_T6INPPS_MASK                     equ 003Fh

// Register: T8INPPS
#define T8INPPS T8INPPS
T8INPPS                                  equ 0E18h
// bitfield definitions
T8INPPS_T8INPPS_POSN                     equ 0000h
T8INPPS_T8INPPS_POSITION                 equ 0000h
T8INPPS_T8INPPS_SIZE                     equ 0006h
T8INPPS_T8INPPS_LENGTH                   equ 0006h
T8INPPS_T8INPPS_MASK                     equ 003Fh

// Register: CCP1PPS
#define CCP1PPS CCP1PPS
CCP1PPS                                  equ 0E19h
// bitfield definitions
CCP1PPS_CCP1PPS_POSN                     equ 0000h
CCP1PPS_CCP1PPS_POSITION                 equ 0000h
CCP1PPS_CCP1PPS_SIZE                     equ 0006h
CCP1PPS_CCP1PPS_LENGTH                   equ 0006h
CCP1PPS_CCP1PPS_MASK                     equ 003Fh

// Register: CCP2PPS
#define CCP2PPS CCP2PPS
CCP2PPS                                  equ 0E1Ah
// bitfield definitions
CCP2PPS_CCP2PPS_POSN                     equ 0000h
CCP2PPS_CCP2PPS_POSITION                 equ 0000h
CCP2PPS_CCP2PPS_SIZE                     equ 0006h
CCP2PPS_CCP2PPS_LENGTH                   equ 0006h
CCP2PPS_CCP2PPS_MASK                     equ 003Fh

// Register: CCP7PPS
#define CCP7PPS CCP7PPS
CCP7PPS                                  equ 0E1Bh
// bitfield definitions
CCP7PPS_CCP7PPS_POSN                     equ 0000h
CCP7PPS_CCP7PPS_POSITION                 equ 0000h
CCP7PPS_CCP7PPS_SIZE                     equ 0006h
CCP7PPS_CCP7PPS_LENGTH                   equ 0006h
CCP7PPS_CCP7PPS_MASK                     equ 003Fh

// Register: CCP8PPS
#define CCP8PPS CCP8PPS
CCP8PPS                                  equ 0E1Ch
// bitfield definitions
CCP8PPS_CCP8PPS_POSN                     equ 0000h
CCP8PPS_CCP8PPS_POSITION                 equ 0000h
CCP8PPS_CCP8PPS_SIZE                     equ 0006h
CCP8PPS_CCP8PPS_LENGTH                   equ 0006h
CCP8PPS_CCP8PPS_MASK                     equ 003Fh

// Register: COG1INPPS
#define COG1INPPS COG1INPPS
COG1INPPS                                equ 0E1Dh
// bitfield definitions
COG1INPPS_COG1INPPS_POSN                 equ 0000h
COG1INPPS_COG1INPPS_POSITION             equ 0000h
COG1INPPS_COG1INPPS_SIZE                 equ 0006h
COG1INPPS_COG1INPPS_LENGTH               equ 0006h
COG1INPPS_COG1INPPS_MASK                 equ 003Fh

// Register: COG2INPPS
#define COG2INPPS COG2INPPS
COG2INPPS                                equ 0E1Eh
// bitfield definitions
COG2INPPS_COG2INPPS_POSN                 equ 0000h
COG2INPPS_COG2INPPS_POSITION             equ 0000h
COG2INPPS_COG2INPPS_SIZE                 equ 0006h
COG2INPPS_COG2INPPS_LENGTH               equ 0006h
COG2INPPS_COG2INPPS_MASK                 equ 003Fh

// Register: COG3INPPS
#define COG3INPPS COG3INPPS
COG3INPPS                                equ 0E1Fh
// bitfield definitions
COG3INPPS_COG3INPPS_POSN                 equ 0000h
COG3INPPS_COG3INPPS_POSITION             equ 0000h
COG3INPPS_COG3INPPS_SIZE                 equ 0006h
COG3INPPS_COG3INPPS_LENGTH               equ 0006h
COG3INPPS_COG3INPPS_MASK                 equ 003Fh

// Register: COG4INPPS
#define COG4INPPS COG4INPPS
COG4INPPS                                equ 0E20h
// bitfield definitions
COG4INPPS_COG4INPPS_POSN                 equ 0000h
COG4INPPS_COG4INPPS_POSITION             equ 0000h
COG4INPPS_COG4INPPS_SIZE                 equ 0006h
COG4INPPS_COG4INPPS_LENGTH               equ 0006h
COG4INPPS_COG4INPPS_MASK                 equ 003Fh

