GopalSaraf/Practicals/PSDL/include/proc/pic16lf1779.inc
// Register: MD1CLPPS
#define MD1CLPPS MD1CLPPS
MD1CLPPS                                 equ 0E21h
// bitfield definitions
MD1CLPPS_MD1CLPPS_POSN                   equ 0000h
MD1CLPPS_MD1CLPPS_POSITION               equ 0000h
MD1CLPPS_MD1CLPPS_SIZE                   equ 0006h
MD1CLPPS_MD1CLPPS_LENGTH                 equ 0006h
MD1CLPPS_MD1CLPPS_MASK                   equ 003Fh

// Register: MD1CHPPS
#define MD1CHPPS MD1CHPPS
MD1CHPPS                                 equ 0E22h
// bitfield definitions
MD1CHPPS_MD1CHPPS_POSN                   equ 0000h
MD1CHPPS_MD1CHPPS_POSITION               equ 0000h
MD1CHPPS_MD1CHPPS_SIZE                   equ 0006h
MD1CHPPS_MD1CHPPS_LENGTH                 equ 0006h
MD1CHPPS_MD1CHPPS_MASK                   equ 003Fh

// Register: MD1MODPPS
#define MD1MODPPS MD1MODPPS
MD1MODPPS                                equ 0E23h
// bitfield definitions
MD1MODPPS_MD1MODPPS_POSN                 equ 0000h
MD1MODPPS_MD1MODPPS_POSITION             equ 0000h
MD1MODPPS_MD1MODPPS_SIZE                 equ 0006h
MD1MODPPS_MD1MODPPS_LENGTH               equ 0006h
MD1MODPPS_MD1MODPPS_MASK                 equ 003Fh

// Register: MD2CLPPS
#define MD2CLPPS MD2CLPPS
MD2CLPPS                                 equ 0E24h
// bitfield definitions
MD2CLPPS_MD2CLPPS_POSN                   equ 0000h
MD2CLPPS_MD2CLPPS_POSITION               equ 0000h
MD2CLPPS_MD2CLPPS_SIZE                   equ 0006h
MD2CLPPS_MD2CLPPS_LENGTH                 equ 0006h
MD2CLPPS_MD2CLPPS_MASK                   equ 003Fh

// Register: MD2CHPPS
#define MD2CHPPS MD2CHPPS
MD2CHPPS                                 equ 0E25h
// bitfield definitions
MD2CHPPS_MD2CHPPS_POSN                   equ 0000h
MD2CHPPS_MD2CHPPS_POSITION               equ 0000h
MD2CHPPS_MD2CHPPS_SIZE                   equ 0006h
MD2CHPPS_MD2CHPPS_LENGTH                 equ 0006h
MD2CHPPS_MD2CHPPS_MASK                   equ 003Fh

// Register: MD2MODPPS
#define MD2MODPPS MD2MODPPS
MD2MODPPS                                equ 0E26h
// bitfield definitions
MD2MODPPS_MD2MODPPS_POSN                 equ 0000h
MD2MODPPS_MD2MODPPS_POSITION             equ 0000h
MD2MODPPS_MD2MODPPS_SIZE                 equ 0006h
MD2MODPPS_MD2MODPPS_LENGTH               equ 0006h
MD2MODPPS_MD2MODPPS_MASK                 equ 003Fh

// Register: MD3CLPPS
#define MD3CLPPS MD3CLPPS
MD3CLPPS                                 equ 0E27h
// bitfield definitions
MD3CLPPS_MD3CLPPS_POSN                   equ 0000h
MD3CLPPS_MD3CLPPS_POSITION               equ 0000h
MD3CLPPS_MD3CLPPS_SIZE                   equ 0006h
MD3CLPPS_MD3CLPPS_LENGTH                 equ 0006h
MD3CLPPS_MD3CLPPS_MASK                   equ 003Fh

// Register: MD3CHPPS
#define MD3CHPPS MD3CHPPS
MD3CHPPS                                 equ 0E28h
// bitfield definitions
MD3CHPPS_MD3CHPPS_POSN                   equ 0000h
MD3CHPPS_MD3CHPPS_POSITION               equ 0000h
MD3CHPPS_MD3CHPPS_SIZE                   equ 0006h
MD3CHPPS_MD3CHPPS_LENGTH                 equ 0006h
MD3CHPPS_MD3CHPPS_MASK                   equ 003Fh

// Register: MD3MODPPS
#define MD3MODPPS MD3MODPPS
MD3MODPPS                                equ 0E29h
// bitfield definitions
MD3MODPPS_MD3MODPPS_POSN                 equ 0000h
MD3MODPPS_MD3MODPPS_POSITION             equ 0000h
MD3MODPPS_MD3MODPPS_SIZE                 equ 0006h
MD3MODPPS_MD3MODPPS_LENGTH               equ 0006h
MD3MODPPS_MD3MODPPS_MASK                 equ 003Fh

// Register: MD4CLPPS
#define MD4CLPPS MD4CLPPS
MD4CLPPS                                 equ 0E2Ah
// bitfield definitions
MD4CLPPS_MD4CLPPS_POSN                   equ 0000h
MD4CLPPS_MD4CLPPS_POSITION               equ 0000h
MD4CLPPS_MD4CLPPS_SIZE                   equ 0006h
MD4CLPPS_MD4CLPPS_LENGTH                 equ 0006h
MD4CLPPS_MD4CLPPS_MASK                   equ 003Fh

// Register: MD4CHPPS
#define MD4CHPPS MD4CHPPS
MD4CHPPS                                 equ 0E2Bh
// bitfield definitions
MD4CHPPS_MD4CHPPS_POSN                   equ 0000h
MD4CHPPS_MD4CHPPS_POSITION               equ 0000h
MD4CHPPS_MD4CHPPS_SIZE                   equ 0006h
MD4CHPPS_MD4CHPPS_LENGTH                 equ 0006h
MD4CHPPS_MD4CHPPS_MASK                   equ 003Fh

// Register: MD4MODPPS
#define MD4MODPPS MD4MODPPS
MD4MODPPS                                equ 0E2Ch
// bitfield definitions
MD4MODPPS_MD4MODPPS_POSN                 equ 0000h
MD4MODPPS_MD4MODPPS_POSITION             equ 0000h
MD4MODPPS_MD4MODPPS_SIZE                 equ 0006h
MD4MODPPS_MD4MODPPS_LENGTH               equ 0006h
MD4MODPPS_MD4MODPPS_MASK                 equ 003Fh

// Register: PRG1RPPS
#define PRG1RPPS PRG1RPPS
PRG1RPPS                                 equ 0E2Dh
// bitfield definitions
PRG1RPPS_PRG1RPPS_POSN                   equ 0000h
PRG1RPPS_PRG1RPPS_POSITION               equ 0000h
PRG1RPPS_PRG1RPPS_SIZE                   equ 0006h
PRG1RPPS_PRG1RPPS_LENGTH                 equ 0006h
PRG1RPPS_PRG1RPPS_MASK                   equ 003Fh

// Register: PRG1FPPS
#define PRG1FPPS PRG1FPPS
PRG1FPPS                                 equ 0E2Eh
// bitfield definitions
PRG1FPPS_PRG1FPPS_POSN                   equ 0000h
PRG1FPPS_PRG1FPPS_POSITION               equ 0000h
PRG1FPPS_PRG1FPPS_SIZE                   equ 0006h
PRG1FPPS_PRG1FPPS_LENGTH                 equ 0006h
PRG1FPPS_PRG1FPPS_MASK                   equ 003Fh

// Register: PRG2RPPS
#define PRG2RPPS PRG2RPPS
PRG2RPPS                                 equ 0E2Fh
// bitfield definitions
PRG2RPPS_PRG2RPPS_POSN                   equ 0000h
PRG2RPPS_PRG2RPPS_POSITION               equ 0000h
PRG2RPPS_PRG2RPPS_SIZE                   equ 0006h
PRG2RPPS_PRG2RPPS_LENGTH                 equ 0006h
PRG2RPPS_PRG2RPPS_MASK                   equ 003Fh

// Register: PRG2FPPS
#define PRG2FPPS PRG2FPPS
PRG2FPPS                                 equ 0E30h
// bitfield definitions
PRG2FPPS_PRG2FPPS_POSN                   equ 0000h
PRG2FPPS_PRG2FPPS_POSITION               equ 0000h
PRG2FPPS_PRG2FPPS_SIZE                   equ 0006h
PRG2FPPS_PRG2FPPS_LENGTH                 equ 0006h
PRG2FPPS_PRG2FPPS_MASK                   equ 003Fh

// Register: PRG3RPPS
#define PRG3RPPS PRG3RPPS
PRG3RPPS                                 equ 0E31h
// bitfield definitions
PRG3RPPS_PRG3RPPS_POSN                   equ 0000h
PRG3RPPS_PRG3RPPS_POSITION               equ 0000h
PRG3RPPS_PRG3RPPS_SIZE                   equ 0006h
PRG3RPPS_PRG3RPPS_LENGTH                 equ 0006h
PRG3RPPS_PRG3RPPS_MASK                   equ 003Fh

// Register: PRG3FPPS
#define PRG3FPPS PRG3FPPS
PRG3FPPS                                 equ 0E32h
// bitfield definitions
PRG3FPPS_PRG3FPPS_POSN                   equ 0000h
PRG3FPPS_PRG3FPPS_POSITION               equ 0000h
PRG3FPPS_PRG3FPPS_SIZE                   equ 0006h
PRG3FPPS_PRG3FPPS_LENGTH                 equ 0006h
PRG3FPPS_PRG3FPPS_MASK                   equ 003Fh

// Register: PRG4RPPS
#define PRG4RPPS PRG4RPPS
PRG4RPPS                                 equ 0E33h
// bitfield definitions
PRG4RPPS_PRG4RPPS_POSN                   equ 0000h
PRG4RPPS_PRG4RPPS_POSITION               equ 0000h
PRG4RPPS_PRG4RPPS_SIZE                   equ 0006h
PRG4RPPS_PRG4RPPS_LENGTH                 equ 0006h
PRG4RPPS_PRG4RPPS_MASK                   equ 003Fh

// Register: PRG4FPPS
#define PRG4FPPS PRG4FPPS
PRG4FPPS                                 equ 0E34h
// bitfield definitions
PRG4FPPS_PRG4FPPS_POSN                   equ 0000h
PRG4FPPS_PRG4FPPS_POSITION               equ 0000h
PRG4FPPS_PRG4FPPS_SIZE                   equ 0006h
PRG4FPPS_PRG4FPPS_LENGTH                 equ 0006h
PRG4FPPS_PRG4FPPS_MASK                   equ 003Fh

