GopalSaraf/Practicals/PSDL/include/proc/pic16lf1779.inc
// Register: CLCIN0PPS
#define CLCIN0PPS CLCIN0PPS
CLCIN0PPS                                equ 0E35h
// bitfield definitions
CLCIN0PPS_CLCIN0PPS_POSN                 equ 0000h
CLCIN0PPS_CLCIN0PPS_POSITION             equ 0000h
CLCIN0PPS_CLCIN0PPS_SIZE                 equ 0006h
CLCIN0PPS_CLCIN0PPS_LENGTH               equ 0006h
CLCIN0PPS_CLCIN0PPS_MASK                 equ 003Fh

// Register: CLCIN1PPS
#define CLCIN1PPS CLCIN1PPS
CLCIN1PPS                                equ 0E36h
// bitfield definitions
CLCIN1PPS_CLCIN1PPS_POSN                 equ 0000h
CLCIN1PPS_CLCIN1PPS_POSITION             equ 0000h
CLCIN1PPS_CLCIN1PPS_SIZE                 equ 0006h
CLCIN1PPS_CLCIN1PPS_LENGTH               equ 0006h
CLCIN1PPS_CLCIN1PPS_MASK                 equ 003Fh

// Register: CLCIN2PPS
#define CLCIN2PPS CLCIN2PPS
CLCIN2PPS                                equ 0E37h
// bitfield definitions
CLCIN2PPS_CLCIN2PPS_POSN                 equ 0000h
CLCIN2PPS_CLCIN2PPS_POSITION             equ 0000h
CLCIN2PPS_CLCIN2PPS_SIZE                 equ 0006h
CLCIN2PPS_CLCIN2PPS_LENGTH               equ 0006h
CLCIN2PPS_CLCIN2PPS_MASK                 equ 003Fh

// Register: CLCIN3PPS
#define CLCIN3PPS CLCIN3PPS
CLCIN3PPS                                equ 0E38h
// bitfield definitions
CLCIN3PPS_CLCIN3PPS_POSN                 equ 0000h
CLCIN3PPS_CLCIN3PPS_POSITION             equ 0000h
CLCIN3PPS_CLCIN3PPS_SIZE                 equ 0006h
CLCIN3PPS_CLCIN3PPS_LENGTH               equ 0006h
CLCIN3PPS_CLCIN3PPS_MASK                 equ 003Fh

// Register: ADCACTPPS
#define ADCACTPPS ADCACTPPS
ADCACTPPS                                equ 0E39h
// bitfield definitions
ADCACTPPS_ADCACTPPS_POSN                 equ 0000h
ADCACTPPS_ADCACTPPS_POSITION             equ 0000h
ADCACTPPS_ADCACTPPS_SIZE                 equ 0006h
ADCACTPPS_ADCACTPPS_LENGTH               equ 0006h
ADCACTPPS_ADCACTPPS_MASK                 equ 003Fh

// Register: SSPCLKPPS
#define SSPCLKPPS SSPCLKPPS
SSPCLKPPS                                equ 0E3Ah
// bitfield definitions
SSPCLKPPS_SSPCLKPPS_POSN                 equ 0000h
SSPCLKPPS_SSPCLKPPS_POSITION             equ 0000h
SSPCLKPPS_SSPCLKPPS_SIZE                 equ 0006h
SSPCLKPPS_SSPCLKPPS_LENGTH               equ 0006h
SSPCLKPPS_SSPCLKPPS_MASK                 equ 003Fh

// Register: SSPDATPPS
#define SSPDATPPS SSPDATPPS
SSPDATPPS                                equ 0E3Bh
// bitfield definitions
SSPDATPPS_SSPDATPPS_POSN                 equ 0000h
SSPDATPPS_SSPDATPPS_POSITION             equ 0000h
SSPDATPPS_SSPDATPPS_SIZE                 equ 0006h
SSPDATPPS_SSPDATPPS_LENGTH               equ 0006h
SSPDATPPS_SSPDATPPS_MASK                 equ 003Fh

// Register: SSPSSPPS
#define SSPSSPPS SSPSSPPS
SSPSSPPS                                 equ 0E3Ch
// bitfield definitions
SSPSSPPS_SSPSSPPS_POSN                   equ 0000h
SSPSSPPS_SSPSSPPS_POSITION               equ 0000h
SSPSSPPS_SSPSSPPS_SIZE                   equ 0006h
SSPSSPPS_SSPSSPPS_LENGTH                 equ 0006h
SSPSSPPS_SSPSSPPS_MASK                   equ 003Fh

// Register: RXPPS
#define RXPPS RXPPS
RXPPS                                    equ 0E3Dh
// bitfield definitions
RXPPS_RXPPS_POSN                         equ 0000h
RXPPS_RXPPS_POSITION                     equ 0000h
RXPPS_RXPPS_SIZE                         equ 0006h
RXPPS_RXPPS_LENGTH                       equ 0006h
RXPPS_RXPPS_MASK                         equ 003Fh

// Register: CKPPS
#define CKPPS CKPPS
CKPPS                                    equ 0E3Eh
// bitfield definitions
CKPPS_CKPPS_POSN                         equ 0000h
CKPPS_CKPPS_POSITION                     equ 0000h
CKPPS_CKPPS_SIZE                         equ 0006h
CKPPS_CKPPS_LENGTH                       equ 0006h
CKPPS_CKPPS_MASK                         equ 003Fh

// Register: RA0PPS
#define RA0PPS RA0PPS
RA0PPS                                   equ 0E90h
// bitfield definitions
RA0PPS_RA0PPS_POSN                       equ 0000h
RA0PPS_RA0PPS_POSITION                   equ 0000h
RA0PPS_RA0PPS_SIZE                       equ 0006h
RA0PPS_RA0PPS_LENGTH                     equ 0006h
RA0PPS_RA0PPS_MASK                       equ 003Fh

// Register: RA1PPS
#define RA1PPS RA1PPS
RA1PPS                                   equ 0E91h
// bitfield definitions
RA1PPS_RA1PPS_POSN                       equ 0000h
RA1PPS_RA1PPS_POSITION                   equ 0000h
RA1PPS_RA1PPS_SIZE                       equ 0006h
RA1PPS_RA1PPS_LENGTH                     equ 0006h
RA1PPS_RA1PPS_MASK                       equ 003Fh

// Register: RA2PPS
#define RA2PPS RA2PPS
RA2PPS                                   equ 0E92h
// bitfield definitions
RA2PPS_RA2PPS_POSN                       equ 0000h
RA2PPS_RA2PPS_POSITION                   equ 0000h
RA2PPS_RA2PPS_SIZE                       equ 0006h
RA2PPS_RA2PPS_LENGTH                     equ 0006h
RA2PPS_RA2PPS_MASK                       equ 003Fh

// Register: RA3PPS
#define RA3PPS RA3PPS
RA3PPS                                   equ 0E93h
// bitfield definitions
RA3PPS_RA3PPS_POSN                       equ 0000h
RA3PPS_RA3PPS_POSITION                   equ 0000h
RA3PPS_RA3PPS_SIZE                       equ 0006h
RA3PPS_RA3PPS_LENGTH                     equ 0006h
RA3PPS_RA3PPS_MASK                       equ 003Fh

// Register: RA4PPS
#define RA4PPS RA4PPS
RA4PPS                                   equ 0E94h
// bitfield definitions
RA4PPS_RA4PPS_POSN                       equ 0000h
RA4PPS_RA4PPS_POSITION                   equ 0000h
RA4PPS_RA4PPS_SIZE                       equ 0006h
RA4PPS_RA4PPS_LENGTH                     equ 0006h
RA4PPS_RA4PPS_MASK                       equ 003Fh

// Register: RA5PPS
#define RA5PPS RA5PPS
RA5PPS                                   equ 0E95h
// bitfield definitions
RA5PPS_RA5PPS_POSN                       equ 0000h
RA5PPS_RA5PPS_POSITION                   equ 0000h
RA5PPS_RA5PPS_SIZE                       equ 0006h
RA5PPS_RA5PPS_LENGTH                     equ 0006h
RA5PPS_RA5PPS_MASK                       equ 003Fh

// Register: RA6PPS
#define RA6PPS RA6PPS
RA6PPS                                   equ 0E96h
// bitfield definitions
RA6PPS_RA6PPS_POSN                       equ 0000h
RA6PPS_RA6PPS_POSITION                   equ 0000h
RA6PPS_RA6PPS_SIZE                       equ 0006h
RA6PPS_RA6PPS_LENGTH                     equ 0006h
RA6PPS_RA6PPS_MASK                       equ 003Fh

// Register: RA7PPS
#define RA7PPS RA7PPS
RA7PPS                                   equ 0E97h
// bitfield definitions
RA7PPS_RA7PPS_POSN                       equ 0000h
RA7PPS_RA7PPS_POSITION                   equ 0000h
RA7PPS_RA7PPS_SIZE                       equ 0006h
RA7PPS_RA7PPS_LENGTH                     equ 0006h
RA7PPS_RA7PPS_MASK                       equ 003Fh

// Register: RB0PPS
#define RB0PPS RB0PPS
RB0PPS                                   equ 0E98h
// bitfield definitions
RB0PPS_RB0PPS_POSN                       equ 0000h
RB0PPS_RB0PPS_POSITION                   equ 0000h
RB0PPS_RB0PPS_SIZE                       equ 0006h
RB0PPS_RB0PPS_LENGTH                     equ 0006h
RB0PPS_RB0PPS_MASK                       equ 003Fh

// Register: RB1PPS
#define RB1PPS RB1PPS
RB1PPS                                   equ 0E99h
// bitfield definitions
RB1PPS_RB1PPS_POSN                       equ 0000h
RB1PPS_RB1PPS_POSITION                   equ 0000h
RB1PPS_RB1PPS_SIZE                       equ 0006h
RB1PPS_RB1PPS_LENGTH                     equ 0006h
RB1PPS_RB1PPS_MASK                       equ 003Fh

// Register: RB2PPS
#define RB2PPS RB2PPS
RB2PPS                                   equ 0E9Ah
// bitfield definitions
RB2PPS_RB2PPS_POSN                       equ 0000h
RB2PPS_RB2PPS_POSITION                   equ 0000h
RB2PPS_RB2PPS_SIZE                       equ 0006h
RB2PPS_RB2PPS_LENGTH                     equ 0006h
RB2PPS_RB2PPS_MASK                       equ 003Fh

